{"global timepieces ": "Global Timepieces was established in 1999, their main business is retailing in watches, from mid-range brand to high-end luxury brand products, original from manufacturers and official dealers. Professional and effective, guidance guaranteed after-sales service and scattering sales network, all of them have constituted the unique business philosophy of Global Timepieces.", "phase eight": "Phase Eight is a premium British womenswear brand founded in 1979 which currently has over 430 stores covering Europe, the Middle East, Australia and Asia.\n \nThe strength of Phase Eight is founded in its originality; exclusive designs combined with high quality fabrics and unique prints that allow for individual translation, with a design philosophy that transcends all ages.\n \nPhase Eight is a leading global destination for customers looking for exceptional casual and occasionwear. ", "d’urban": "D’URBAN came to the forefront of quality fashion menswear in 1970. Founded in Japan, D’URBAN is inspired by the long-held traditions of prestigious tailoring in Europe. Dedicated development and research into the latest technology into colours, fabrics, designs and cutting have brought the brand to international prominence in the menswear arena. Today, the D’URBAN collection includes both sophisticated business and leisure wear.", "aape by a bathing ape": "Streetwear giant A BATHING APE has become one of the leading Japanese fashion labels since it was founded in 1993. Using the face of an ape as its logo and the classic moniker “Ape shall never kill ape” from the movie Planet of the Apes, the label has been embraced by fashion lovers with its urban and hip hop style. In S/S 2012, A BATHING APE has launched a brand new collection - AAPE BY A BATHING APE. Full of energy and vitality, the new collection targets the younger generation, showing simple, casual, yet trendy design. To continue A BATHING APE’s constant innovation, AAPE BY A BATHING APE will begin its collaboration journey with international trendy brands in launching various limited editions, which are bound to cause sensations citywide.", "diamanti per tutti": "Proud of its Antwerp roots, Diamanti Per Tutti makes diamond jewelry fun, fashionable and accessible.\n\nInspired by timeless lines and shapes, a Diamanti Per Tutti is your every day companion. Never dominating, always making you feel ultra feminine, beautiful and unique.\n\nOur jewelry is made from Sterling Silver, handset with ethically sourced natural diamonds and gem stones and available in 18 carat pink and yellow gold vermeil or white rhodium. ", "fila": "Fila was founded in 1911, a small alpine town of Biella, Italy, a place renowned for manufacturing the world's finest textiles, and weaving fabrics with impeccable quality, true innovation and extraordinary beauty. Born of this city and its traditions, Fila is inexorably derived from Biella's dedication to artistry, luxury and elegance. This is our birthright, it's in our soul, and it ultimately defines us.", "vivienne tam": "VIVIENNE TAM is an international designer known for her culture-bridging, East-meets-West approach to design as well as pioneering global collaborations marrying fashion with technology.  VIVIENNE TAM effortlessly blends her cultural roots with a modern design vocabulary recognized for its artistry.  She is the author of the award winning book China Chic and pieces from her collections are housed in the permanent archives of the world’s most prestigious museums including the Metropolitan Museum of Art in New York and the Victoria and Albert Museum in London.  Her collections can be found in 30 freestanding retail stores and over 100 specialty and department stores worldwide.", "millie’s": "millie’s is a brand for genuine and young girls who embrace adventure and challenge, always true to herself in her outlook of life, constantly changing her world for a more colorful future.", "go wild": "Go Wild, the one-stop travel select shop, combed the globe to discover world-class outdoor travel brands that deliver on the promise of functionality and sophisticated design, with over 1,000 items of supreme gears and smart gadgets.  ", "atsuro tayama": "Paris-based Japanese designer ATSURO TAYAMA is most reputed for his innovative designs that combine the subtlety of his Eastern influence with the more relaxed and fluid silhouettes of the West. The debut of his signature collection ATSURO TAYAMA in Paris in 1991 distinctively reflected his design philosophy that “Fashion is a universal language” emphasizing on comfort and styles that encompassed the characteristics of the two genders.\n \nThe signature TAYAMA’s style is being carried on every season with fresh looks to cater to the same elegant and spirited woman, with sophisticated casuals to stylish mannish suits that spell a touch of airiness and complexity, utilizing at the same time the latest techniques in materials and patterns to underline his signature style.", "staccato": "STACCATO is an iconic fashion footwear brand which encompasses a confident sense of style. STACCATO commits to excite and inspire the fashionista with its edgy yet sophisticated design. The brand brings the exquisite shoes from runway to real way which expresses the cosmopolitan working ladies with their unique style every day.", "swarovski": "Swarovski, the leading crystal brand, leverages its centenary heritage of crystal cutting expertise, to light up the world with its own branded collections of crystal jewelleries, fashion accessories and watches. With continual pioneering innovative craftsmanship, Swarovski crystals products become more brilliant and faceted. Swarovski strives to create new desires on fashion jewelleries and accessories, which are supported by markets with a recognized demand. It also pushes the envelope of crystal design by combining fashion trends and crystal elements with exceptional, celebrated savoir-faire. This gives Swarovski creations an air of stylish individuality that dazzles the world of fashion and luxury.", "kipling": "Kipling started in 1987 in Antwerp, the city of fashion and is part of the ‘Outdoor’ group of the VF Corporation, a world player famous for its well-known brands. The brand mascot is a popular little monkey dangling from each bag. Kipling plays a part in the everyday life of more than 40 million women in 67 countries throughout the world. Their Kipling accompanies them on their way to work, on their shopping trips, whilst playing sports, at work, and on their evenings out. No wonder because Kipling bags are simply unique. They are not only super trendy but are also of high quality, practical and affordable.", "longchamp": "Longchamp was founded in Paris in 1948. Diversified into luggage, handbags and accessories, Longchamp has asserted its fashion credentials with the creation of internationally desirable It-bags and the launch of complete shoes and ready-to-wear collections. Combining craftsmanship and innovation, Longchamp owns more than 230 exclusive boutiques worldwide and is available in more than 2,000 multi-brand stores in over 100 countries.", "kingkow": "Kingkow is recognized for it's unique design offering high quality clothing and accessories for infants and children up to age of 14, comfort and practicality are the key pursuit. Matching items like accessories, scarves, sunglasses and shoes are also offered.  The shop is designed for kids and parents with comfort and chic style to bring the shopping experience to the next level.", "calvin klein performance": "Our “activewear” brand CALVIN KLEIN PERFORMANCE is rooted in the heritage of the Calvin Klein Brand representing an active, modern lifestyle brand with a designer sensibility, infused with performance technology blending optimal fit and function. Our range of work out, hang out and go out products appeal to those who are constantly on the go, looking for the perfect pieces to transition seamlessly in their lives. ", "weekend by maxmara": "WEEKEND by MaxMara was born in 1984 proposing a style for MaxMara women in their free time. When women’s way of life evolved, they needed more comfortable clothes not only for weekends but also to make their daily lives easier and enjoyable.\n\nWEEKEND is casual life, comfort and informality. It’s a new sportswear: clothes for everyday as well as outfits for special occasions or working days. Collections are fun, elegance, comfort, style and trend at the same time. It’s a classic concept with a touch of glamour in timeless and enduring items.", "repetto": "Repetto, a brand that has been producing exquisite dancewear for 70 years. Since 1947, ballet dancers from all over the world have been astounded by the delicacy and comfort of the brand with its unique process of fabrication, ‘stitch and return’, developed by Rose Repetto. The technique is also the basis of the grandeur of its city shoes and leather bags. Today, Repetto is a name for luxurious comfort, with fans all over the world including Hillary Clinton, Sarah Jessica Parker, Gwyneth Paltrow, Kate Moss and Jessica Stam. Repetto also provides the exclusive L’atelier Repetto customisation service that is highly popular for customers seeking one-of-a-kind designs.", "anagram": "anagram is a homegrown womenswear label designed to cater to the discerning woman who appreciates quality over quantity and timelessness over trends. Using luxurious materials sourced from Europe and Japan, the anagram collection features versatile and easy-to-wear pieces that one can easily mix and match for a myriad of different looks. In a market with no shortage of womenswear catering to professionals on and off duty – anagram stands unique.", "calvin klein jeans": "Offerings under this label include men’s and women’s jeans and related apparel, which are distributed worldwide, and accessories, which are distributed in Europe, Asia and Brazil.  With roots in denim, it is the casual expression of the CALVIN KLEIN brand and is famous for its unique details and innovative washes. The brand embraces its iconic, American legacy, while also introducing new and trend-setting styles.", "little mo&amp;co. ": "Consistent with MO&Co. adults' apparels, Little MO&Co. create [boy-gal] style with natural textiles, imaginary fun design and MO-style rock, creating a fun, chic, comfy and practical MOstyle wardrobe for the cool kids.", "bally": "Bally is a Swiss luxury brand established in 1851, anchored in an exceptional heritage of shoemaking. Today the brand offers unique designs across shoes, accessories and ready to wear, driven by a strong, retro sportswear aesthetic. ", "lululemon athletica": "Established in Vancouver, Canada in 1998, lululemon is a technical athletic apparel company inspired by yoga.  We make product for both men and women for all their sweaty pursuits. The manifesto print on our shoppers is a collection of lines that are thought-provoking, inspirational and reflect our values.  It's a visual representation of our beliefs, it's what we stand for.  ", "lenscrafters": "A premium retailer under Luxottica Group, the world’s eyewear industry front-runner, LensCrafters is a global pioneer in optical fashion with access to the Group’s renowned brands from around the world. Since entering the Chinese market in 2006, the number of LensCrafters chain stores in the Greater China region has grown to more than 200.", "bread n butter ": "The brand founder, Victoria, believes every woman is “beautiful” and has her own talents. Self confidence and self respect would bring out one’s beauty. Talents would motivate one to pursuit her dream. Thus, “beautiful and talented” has always been the philosophy of bread n butter. In order to promote this brand philosophy, bread n butter invites beautiful artists with real and specific talents to be its inspirational muses for each season’s collection. This gives birth to the Libertines’ Collection, with various series of fashion illustrating the same philosophy.", "gilly hicks": "", "vans": "VANS, The original action sports footwear, apparel and accessories brand, promotes the action sports lifestyle, youth culture and creative self-expression.", "nike kicks lounge ": "The world top sports brand, Nike carries complete selection of trendy footwear, apparel and accessories.  Nike Kicks Lounge captures the spirit of each collection that brings to life the unconventional psyche of today’s athlete style and breathes the soul of Nike’s heritage.", "rigby &amp; peller": "International luxury lingerie retailer Rigby & Peller has 75 years of fitting room experience. Stamped with the royal seal of approval since 1960, Rigby & Peller specializes in personal Lingerie Styling service for women and gives advice on cherry-pick lingerie which matches with their taste, lifestyle and personality. The brand offers a range of permium lingerie from A to I cups. Now, Rigby & Peller is expanding over the world, from U.K. to Germany, Spain, Denmark, China and Hong Kong.", "tommy hilfiger": "Established in 1985, Tommy Hilfiger is one of the world’s leading premium lifestyle brands, delivers superior styling, quality and value to consumers worldwide. The brand celebrates the essence of Classic American Cool and provides a refreshing twist to the preppy fashion genre. Tommy Hilfiger offers consumers a breadth of beautifully designed, high quality products including men’s, women’s and children’s apparel, sportswear, denim, and a range of licensed products such as accessories and fragrance. The Tommy Hilfiger label appeals to those seeking a new interpretation on classic American style.", "jins": "JINS is an Japanese eyewear brand founded in 2001 with more than 300 stores. It provides the crafting stylish, high-quality and innovative eyewear at affordable prices. Brings you the convenient, comfortable and brand new shopping experience.", "global timepieces • prestige": "Global Timepieces was established in 1999, their main business is retailing in watches, from mid-range brand to high-end luxury brand products, original from manufacturers and official dealers. Professional and effective, guidance guaranteed after-sales service and scattering sales network, all of them have constituted the unique business philosophy of Global Timepieces.", "tumi": "Since 1975, TUMI has been creating world-class business and travel essentials, designed to upgrade, uncomplicate, and beautify all aspects of life on the move. Blending flawless functionality with a spirit of ingenuity, we’re committed to empowering journeys as a lifelong partner to movers and makers in pursuit of their passions. The brand is sold globally in over 75 countries with upwards of 2,200 points of sale. ", "kate spade new york": "In 1993, Kate Spade designed the utilitarian bag, she had been craving for years but couldn’t find anywhere and so began a revolution in the accessories market.  Simple silhouettes with clever details and crisp palettes soon established a visual shorthand for the brand that’s recognizable the world over.\n \nIn 2007, Kate Spade turned the reins over to the design powerhouse, Liz Claiborne Inc. which then became Fifth & Pacific Companies Inc, and now operates under Kate Spade & Company (nyse: kate). Deborah Lloyd took the helm as chief creative officer with an aim to broadening the line while honoring kate’s rich history.\n \nToday you’ll find the brand on the arms of women everywhere with nearly 300 kate spade new york stores worldwide and a thriving e-commerce business.", "rockport": "Rockport is one of the most prestigious international footwear brand originated from United States. Over the past 40 years, Rockport continues to make style comfortable for metropolitan professionals around the world.", "ted baker": "Established in 1988, Ted Baker London offers stylish and sophisticated menswear, womenswear, accessories (and everything in between), and is renowned for its quality and distinctive use of pattern and colour.\n \nFamous for the finest customer service (which is at the very heart of what makes Ted Baker, as they say in London, “a cut above”), Ted’s unconventional approach to fashion, irreverent sense of humor and, above all, attention to detail appeals to fashionable men and women who trust Ted to deliver that certain something out of the ordinary.", "puma": "Puma is one of the world’s leading Sports Brands, designing, developing, selling and marketing footwear, apparel and accessories. Puma offers performance and sport-inspired lifestyle products in categories such as Football, Running, Training and Fitness, and Motorsports.", "jack wills": "Jack Wills was launched in 1999 in Salcombe, Devon, designing British heritage-inspired goods for the university crowd. We continue to be influenced by the best of British, from our history and culture to sporting and country pursuits. We take pride in using the finest quality materials, techniques and design to deliver our distinctive connection between the old and new, epitomising what it is to be young and Fabulously British.\n \nFrom the iconic British university towns of Oxford and Cambridge, the Ivy League campuses of Harvard and Yale, and the bright lights of Hong Kong, Jack Wills is travelling the globe proudly planting the Union Jack at over 60 stores and counting. ", "a.testoni": "The history of a.testoni began in 1929 with master shoemaker Amedeo Testoni at Bologna Italy, whose \"bottega\" specialized in fine handmade men's shoes. Internationally recognized in the panorama of luxury for the quality of its creations and the traditional shoemaking techniques still in use, a.testoni represents a complex productive reality. Every stage of the manufacturing process is carefully controlled to deliver the highest quality standards.", "hollister": "At Hollister, we believe in liberating the spirit of an endless summer inside everyone. To us, summer isn’t just a season, it’s a state of mind. Hollister creates comfortable, carefree style to live in every day, so you’re ready to take on endless summer adventures, whatever the season.", "michael kors": "MICHAEL KORS is a world-renowned, award-winning designer of luxury accessories and ready to wear. His namesake company, established in 1981, currently produces a range of products through his Michael Kors and MICHAEL Michael Kors labels, including accessories, footwear, watches, jewelry, men’s and women’s ready to wear, and a full line of fragrance products. MICHAEL KORS stores are operated, either directly or through licensing partners, in some of the most prestigious cities in the world, including New York, Beverly Hills, Chicago, London, Milan, Paris, Munich, Istanbul, Dubai, Seoul, Tokyo and Hong Kong.", "brooks brothers": "Established in 1818, Brooks Brothers was the first to offer ready-to-wear clothing and has continued throughout history with iconic product introductions including: seersucker, madras, the non-iron shirt and the original button-down collar. Nearly two centuries later, Brooks Brothers is proud to uphold the same traditions and values and to be the destination for ladies and gentlemen from every generation. Since its founding 195 years ago in New York, Brooks Brothers has become a legendary international retailer while maintaining a steadfast commitment to exceptional service, quality, style and value.", "pandora": "Founded in 1982 and headquartered in Copenhagen, Denmark, PANDORA employs more than 14,200 people worldwide.   PANDORA designs, manufactures and markets hand-finished and contemporary jewellery made from high-quality materials at affordable prices. PANDORA jewellery is sold in more than 90 countries on six continents through approximately 9,500 points of sale, including more than 1,500 concept stores.", "levi’s": "As the authority in denim, Levi's® jeans were invented by Levi Strauss & Co. in 1873 and have since become one of the most recognisable and imitated clothing items in the world - capturing the imagination and loyalty of people for generations. Today the Levi's® brand portfolio continues to evolve through the relentless pioneering of products with innovative spirit that is unparalleled in the apparel industry. Levi's allows individuals around the world to express their personal style. In Levi's® Stores, you can enjoy not only an impressive in-store environment but also a comfortable atmosphere for great service and an amazing shopping experience.", "moiselle": "Founded in 1997, Moiselle is an international high fashion brand renowned for its stylish and exclusive designs, high-quality fabrication and exquisite craftsmanship. Focusing on every hand-made detail such as embroideries, sequins and other accessories, it demonstrates the scent of gorgeous one of its kind. Two fashion lines from Moiselle, Classic Moiselle and The New Look, provide different choices for ladies. Unique design, plentiful details, exquisite cutting and snug fabrication create a winning combination of a perfect Moiselle style. Both lines offer perfect choice from everyday work wear, elegant gown to tailor-made evening gown. The modern yet sophisticated design demonstrates new style of now-a-day elegancy.", "playlord": "Playlord aims to generate wearable with independent, clean and modern style for the business executives. Since its inception, Playlord has carved itself a niche market through its high quality with an extensive selection of beautiful made and leading-edge fashion design.", "geox": "GEOX, the shoe that breathes, is the leading Italian footwear brand for men, women and children that combines fashion and technology.   \n\nAll Geox products feature Italian design and a patented technology where a perforated outsole and a microporous membrane allows humidity to be evaporated  thus keeping feet cool and dry.", "monsoon children": "The British Monsoon Children’s wear chain is a favorite of many for fun and colorful Children Collection ranging from brilliant beachwear and fun daywear to perfect party outfits. The range consists of Girl’s wear, Baby wear, Boy’s wear, Footwear and Accessories, extended the Monsoon look and philosophy to the whole family, creating an innovative and creative product.", "i.t blue block": "i.t blue block, a brand new fashion concept space developed by i.t, offers fashion and apparel, food and beverage, lifestyle and homeware, footwear and accessories, and outdoor gear under the same roof. The store features international fashion labels including as know as de base, BEAUTY&YOUTH UNITED ARROWS, carhartt WIP, FRED PERRY, JOURNAL STANDARD relume, mercibeaucoup, and STYLENANDA, among others. Meanwhile, it also boasts a string of outdoor brands such as DANTON, karrimor and snow peak, as well as Korean cosmetic heavyweight 3CE and fragrance-maker Soohyang. Together with J.S. Foodies, the American-style restaurant originated from Japan, i.t blue block provides one-stop shopping experience for customers. ", "izzue": "A phenomenon in the Asian fashion scene since its debut in 1999, izzue is at the fore-front of original creation and the ideology of Casual Chic. With over 100 stores around the globe, izzue is the essential wardrobe of global fashionistas. The collections including casual line, IZZUE COLLECTION, izzuextreme, izzuexplore, Army line and izzue x Neighborhood special project - NHIZ are emblems of selfhood, injecting flamboyance and subtle surprises to one that craves the spotlight for existence.", "g2000": "With sophisticated blended fabrics and perfect cutting, G2000 offers highly versatile coordinating pieces and in-trend styles that fulfill modern men’s and women’s need for presentable and confident city living across their career wardrobe and relaxed occasions.", "chow sang sang": "With a rich heritage spanning over 75 years, Chow Sang Sang is the leading jewellery manufacturer and retailer in the trade, operating over 270 shops throughout the Greater China region. Chow Sang Sang is famous for its trendy product design and quality craftsmanship. Apart from self-innovated products, Chow Sang Sang sources world-class jewellery brands in order to provide a wider choice of quality jewellery for its customers. Its professional and complete jewellery services always ensure customers a satisfactory shopping experience.", "camper": "Camper is the visionary and pioneer in the shoe industry. The first Camper store debuted in Barcelona in 1981, it represents a concept reflecting a new lifestyle -- a concept based on freedom, comfort and creativity that revolutionized the world of traditional shoemaking.", "cole haan": "Cole Haan is turning nearly a century of iconic footwear inside out. The name-synonymous with timeless style and detailed craftsmanship since 1928 has become a beacon of big thinking, channeling their storied heritage into inventive engineering of the future. By integrating purposeful technology into both modern and classic designs, the global lifestyle brand has further dedicated itself to enabling their extraordinary customers to look the part and feel the part, while pushing the limits on what shoes (and beyond) can do. The company calls New York City and Greenland, New Hampshire home, but you can find Cole Haan everywhere. ", "anteprima": "In 1993, Izumi Ogino created a contemporary new face - sensitive to beauty without borders. Anteprima is created for a woman of all seasons: Intelligent, Confident, Feminine and Joyful. Perfectly refined collections that channel a woman's worldly sophistication. Inspired by Izumi’s personal experiences, Anteprima upholds quality and beauty to the highest standard; these core values continue to cement its success and growth in the world’s most vibrant cities. Izumi has captivated the fashion world since the brand’s debut – as its name in Italian – at Milano Moda Donna in 1998.", "ecco": "ECCO, a world-leading brand of shoes combining style and comfort, has built its success on uncompromising quality, innovative technology, and the design philosophy - “the shoe must follow the foot”. ECCO is the only major shoe manufacturer to own and manage every step of the shoemaking process, and its employees are the life force behind its products, designing, developing, producing, and taking responsibility for every detail. ECCO’s products can be found in 4,000 branded sales locations in over 90 countries, a growth fueled by ECCO’s consistent aim of making the best shoes in the world.", "h&amp;m": "H & M Hennes & Mauritz AB (H&M) was established in Sweden in 1947, it is synonymous with affordable as well as up-to-date and high quality fashion. H&M has a wide product range that is divided into a number of different concepts for women, men, teenagers and children. The company’s clothing collections are created by its own designers, pattern makers and buyers. H&M has more than 94,000 employees and approximately 2,500 stores in 44 markets, including franchise markets.", "s.t. dupont": "S.T. Dupont is the perfect expression of Parisian touch and assertive allure. Throughout the years, lots of nobles, Royal ministries and celebrities loved and aspired our products. The pursuit of the 4 ARTs in their wide and luxury collection of pens, lighters, leather goods and accessories to privilege customers: The art of fire, the art of travel, the art of writing and the art of seduction. That’s why S.T. Dupont put much effort and carefulness in selection of raw materials and techniques in producing their products. We welcome you to travel with S.T. Dupont to experience the exceptional quality of the S.T. Dupont journey.", "gapkids &amp; babygap": "Gap was established in the United States, specializing in American casual wear. In 1969, Gap opened its first store in San Francisco. Over the years, Gap continues reshaping classic, leading the trend, from a pair of jeans to womens, mens, GapKids, babyGap, accessories and more products.", "toys “r” us": "Toys“R”Us is the world’s leading specialist toy and juvenile products retailer, offering a unique shopping experience with a comprehensive collection of toys all year round, including all the latest, “hot & in” toys as well as educational toys, baby items, sports & outdoor toys, board games, family fun items, and electronic hardware and games, boys’ toys & girls’ favorites. ", "madia ": "Madia is “Art that you wear”. Jewellery in Madia is meticulously fashioned and elegantly produced by prominent designers and experienced craftsmen to be a precious collectible. Combining traditional jewellery craft and European esthetics, Madia awakens the fashionable ladies to the pursuing of jewellery art by innovative and exquisite designs. In order to fulfill the high demand of quality diamond jewellery, Madia carefully imported worldwide renowned branded diamonds, including “ASHOKA” by William Goldberg, famous for being “Larger”, “More brilliant” and “Rarer”, that are cherished by celebrities around the world.", "club monaco": "CLUB MONACO is a women’s and men’s fashion brand built on thoughtful, versatile design that celebrates the individual. Born in Canada and raised in New York, CLUB MONACO is home to190 stores across the U.S., Canada, the UK and Asia ", "dr. kong footcare": "Dr. Kong was established in 1999. We were the first to promote our innovative “Check & Fit” foot assessment and insole fitting service and provide free profession foot assessment to people of all ages. We provide healthy shoes and foot care products for babies, children, adult and the elderly so that everyone can wear comfortably and healthily. According to our customer’s feet condition, we recommend the most suitable and economical foot care products.", "gucci timepieces &amp; jewelry ": "Gucci watches are made in Switzerland, recognized for their innovative and contemporary design, quality and craftsmanship.\n \nGucci jewellery offers Italian made designs that can be worn every day and treasured forever. ", "cath kidston": "Cath Kidston Limited, ‘The Home of Modern Vintage’, was founded in 1993 with a single store in London’s Holland Park. The company has become synonymous with classic British design and nostalgic style, offering a full range of lifestyle products across homeware, accessories, women’s and children’s fashion in unique and playful prints.\n\nCath Kidston began to expand into international markets in 2006 with the first Japanese store opening in Tokyo. Today, the brand boasts over 200 stores worldwide across Spain, France, Japan, South Korea, Thailand, Taiwan, Hong Kong, China, Singapore, Philippines, Indonesia and The Middle East. ", ":chocoolate": ":BLACK CHOCOOLATE was established in Fall/Winter 2006, determined to bring casual wear to another extent, simple yet tasteful; since then it has become an essential collection for men's daily wear. Ladieswear followed closely, :WHITE CHOCOOLATE collection was born two years after embracing a fun and youthful look of a lady. Up to date, there are more than 30 stores throughout Greater China and is expected to grow across the broader in the coming future.", "kinji": "Founded by Japanese native Kyoko KINJI in 1995, KINJI has been transforming Zen into contemporary chic for more than a decade. Adored for its lush fabrics and elegantly designed fashion and accessories collections, KINJI has always been adhering to the aesthetic principle of “beauty is simplicity” and been paying particular attention to materials and colours. Only quality products can stand the test of time. It is precisely the persistence on quality that has made Kinji increasingly popular among its customers.", "j.lindeberg": "The Scandinavian fashion house was founded in Stockholm in 1996 with the vision to build an international brand for modern and aware consumers. J.Lindeberg bridges fashion and function, offering outstanding products for a modern active lifestyle. The collections consist of men’s and women’s fashion, golf and ski collections. The fashion collections are presented at the international fashion weeks in New York, Beijing, London and Stockholm. The sportswear collections are worn by some of the world’s best athletes.\n\nThe company is headquartered in Stockholm, Sweden.\n ", "lacoste": "For LACOSTE, Life is a Beautiful Sport!\n\nSince the very first polo was created in 1933, LACOSTE relies on its authentic sportive roots to spring optimism and elegance on the world thanks to a unique and original lifestyle for women, men and children.\n\nWith a vision to be the leading player in the premium casual wear market, the brand is today present in 120 countries through a selective distribution network. Two LACOSTE items are sold every second in the world.\n\nAs an international group gathering 10,000 women and men, LACOSTE offers a complete range of products: apparel, leather goods, fragrances, footwear, eyewear, home wear, watches and underwear, all of them being elaborated in the most qualitative, responsible and ethical way. In 2015, the brand garnered a turnover of 1.95 billion euros.", "b ab": "b+ab is an original Hong Kong fashion brand offering quality ladies fashion. b+ab provides a variety of fashionable outfits from head to toe, including ladies wear, footwear, accessories and handbags that enhance personal style. There are 3 different lines from the brand; High Fashion Line, Fashion Line and Jeans Line which are fashionable and easy wearing to work and leisure for young ladies. In 2012 summer, b+ab has launched a sexy and romantic collection – Rouge Collection, provides more fashionable choices for you.", "gieves &amp; hawkes": "The fabled Savile Row suit-maker was founded in London in 1771, making it one of the country’s oldest bespoke tailors.The first to establish itself on Savile Row, Gieves & Hawkes now has stores and points of sale across the globe; it also holds three Royal Warrants of Appointment to HM The Queen, HRH The Duke of Edinburgh, and HRH The Prince of Wales. The Royal Warrants are awarded only to brands that supply the British Royal Family and have been granted to Gieves & Hawkes from the award’s inception in 1809.", "mothercare": "mothercare - the no.1 recommended baby & toddler retailer in the world.\n \nmothercare is a British retailer born over 50 years ago out of an idea to provide parents and parents-to-be with the best quality and most innovative products for their children under one roof.\n \nWithin the UK, mothercare operates on the high street and out of town, and has well over 400 shops.  Internationally, mothercare has over 1,000 international stores across 60 countries, and is expanding at an exponential rate.\n \nmothercare offers an extensive collection of high quality furniture, bedding, maternity wear, strollers, toiletries and clothing for babies and toddlers. mothercare is the one-stop shop for all your maternity and baby needs.", "sandro": "Evelyne Chetrite, the creative director and spirit of Sandro, founded Sandro in 1984. Each collection is designed to offer modern and sophisticated pieces with offbeat and unexpected detailing essential for every wardrobe. The Sandro silhouette is elegant and refined, with a hint of androgyny.", "rebecca minkoff": "The first pop-up store of the New York-based affordable luxury brand Rebecca Minkoff has arrived in Festival Walk. Rebecca Minkoff is a global brand with a wide range of apparel, handbags and accessories. The unique vision for the brand is singularly focused on the ideal modern girl, who experiences all of life’s exciting moments, with her confident, go-anywhere, do-anything attitude. The iconic “Morning After Bag” and edgy “downtown romantic” style of Rebecca Minkoff are the most sought after items of fashion-forward, modern women around the world. Come visit us and view the latest Spring Summer Collection with playful and subtly edgy designs that appeal to contemporary young women and celebrities alike.", "lancaster": "Since its creation, LANCASTER has established itself as one of the most important French leather goods brands in the segment of affordable luxury.\n\nFounded by Thomas Tchen in Paris, the brand was gradually built around strong values and keywords; innovation, constant renewal, always at the very edge of fashion and trends. Leather work is the high point of all creations; it is placed at the heart of the creation process to offer high-quality products.", "cocktail": "COCKTAIL is a select shop selling worldwide contemporary fashion and accessories. Gathered various fashion trends and attitudes to generate new era of women in confidence, bold and imaginative and also bring a variety of new stimuli and new international shopping angle for fashion.", "gigasports": "GigaSports is a professional Sports superstore that provides customers with a spacious shopping environment and a unique one-stop experience. At GigaSports, shoppers can discover one of Hong Kong’s most impressive and complete assortment of sporting goods with a wide selection of the most popular sports including swimming, running, soccer, fitness & yoga, racket sports, outdoor and basketball. Their finest collections of globally recognised sports brands ensure that customers can always find functional sports merchandise and apparel from the leaders in sports wear and equipment.", "samsonite": "Samsonite's journey begun at the turn of the century with founder Jesse Shwayder at the helm. His value and vision for innovation and high quality, coupled with his integrity and honesty is the philosophy by which Samsonite operates today. Samsonite's ability to perceive and adapt to the changing needs to travelers has made the brand a leading authority for people on the move throughout the years. For almost 100 years, Samsonite has proven itself to be the worldwide leader in innovation travel solutions. Today, the journey continues as Samsonite creates timeless collections infused with quality craftsmanship and great style.", "chow tai fook": "Founded in 1929, the iconic brand \"Chow Tai Fook\" of the Group has been widely recognised for its trustworthiness and authenticity, and renowned for product design, quality and value. The legacies of the Group and its iconic brand are rooted in innovation, craftsmanship and heritage. The Group also encompasses other jewellery brands including Hearts On Fire, MONOLOGUE and SOINLOVE.", "columbia sportswear company": "Since 1938, Columbia has strived to provide all nature lovers with the best comfort and protection through multiple patented technologies. Gear up with the new all-purpose outdoor jackets to enhance your experience in all kinds of weather.", "smiggle ": "Where a smile meets a giggle, it’s the world’s greatest place!  The world’s hottest stationery brand is a treasure trove filled with everything you need for school, homework, the office or play.  Smiggle stores are bursting with bright, bold, fashionable and innovative stationery, bags, lunchboxes, accessories, gadgets, toys and more. so come visit and explore!      ", "mides": "The motto evolves around M,I,D,E,S, as showed in the icons. Each of the characters of “Mides” carries the core value for the corporate and could be seen throughout the business operations. They aim to offer products with safety, comfort and quality to babies as they believe that babies, being the end users of our products, would require extra care and higher standard during production.", "marella": "Marella, part of the Max Mara Fashion Group, was established as a collection in 1973 and as an autonomous company in 1988. With its own many-faceted collections, Marella satisfies a wide range of consumers and is in tune with their needs, always attentive to the changing styles and moods in society as well as always able to propose ideas for the most diverse occasions.", "aigle": "Founded in France in 1853, AIGLE has continued to develop its unique know how for more than 150 years, combining style and functionality. AIGLE rubber boots are handmade in France along with AIGLE parkas. Together they are the showcase products, which represent the brand’s precious craftsmanship with quality.", "agnès b. ": "agnès b. - the French lifestyle brand that designer Agnès Troublé founded in Paris in 1975, is a brand of style, enthusiasm and creativity. Her design, which is renowned for clean cut, effortless chic and vivid colours, continues to offer irresistible favourite pieces to people around the world, providing the perfect wardrobe to men and women.  ", "iblues": "iBLUES was established in 1998 and is synonymous with hip and contemporary fashion. It exhibits a classy and diversified look from basic functionality to smart dressing to meet a wide range of needs. Its styles run the gamut from ultra sporty to luxurious eveningwear to cater the needs of ladies for different occasions.", "adidas originals": "adidas Originals is the authentic, iconic sportswear label for the street and its message is Celebrate Originality.", "furla": "Established in 1927 by Aldo Furlanetto in Bologna, FURLA looks to the future with a foot grounded in its solid past of time-honored craftsmanship, a sophisticated elegance and a playful originality.\n \nFURLA invented the inclusive luxury concept. For over 90 years, the brand has been guided by the idea that “every woman deserves beauty and quality at a fair price”. \n \nFURLA produces bags, shoes, and small leather goods for both women and men. New licenses for textile, eyewear and watches are extending FURLA’s top quality craftsmanship and contemporary design aesthetic with the purpose to create lifestyle accessories that share its Italian attitude with the world.\n \nThe company is present in 100 countries with 444 mono - brand stores situated on the most prestigious international shopping streets, a distribution network with over thousand official points of sales and important growing channels as travel retail and e-commerce.", "inside edge": "Inside Edge is one of the well known skate shops in Asia. Located on the left side of the Festival Walk Glacier, providing high-quality products, like MK and JW blades, SP Teri, Harlick and Don Jackson skates and other services. Inside Edge is constantly introducing new skating products to its customers. If there is something in particular you're looking for, their staffs will help find the best skating products for you.", "moussy": "MOUSSY is a Japanese trendy, high-casual brand. DENIM, STANDARD, VINTAGE and BLACK; Adopting the essence of these four keywords, MOUSSY is committed to encouraging self-confidence, keeping up with trends and becoming the equivalent of independent new women.", "glasstique": "At Glasstique, customers are greeted by professional staff, offered with personalized services, and exposed to the most amazing showcase of the finest eyewear that would certainly include your object of desire. Glasstique presents an eye-dazzling line-up of world - renowned fashion and designer brands, which are superb in quality and diverse in style. From the trendsetting fashion houses to emerging names across the globe, Glasstique offers a myriad of choices that express your vigour and personality.", "fila kids": "With a philosophy of innovation and a commitment to performance and style, Fila’s well-known international kids wear brand Fila Kids continues to make a statement with styles that are novel in aesthetic, effective in function and as bold and breakthrough as its wearers. ", "blaack": "BLAACK, the attitude of European sophistication is your passport to everything.\n  Double A in the BLAACK stands for Alpha Male, the brand insist meticulously to hand-pick the finest quality of European fabrics from the world’s best mills to meet your various sartorial needs. BLAACK understand the Asian Fit, together with the tasteful use of premium contemporary craftsmanship, to create the foundation of a casual yet formal style fit.", "patagonia": "Patagonia is a world leader in the design and marketing of performance and lifestyle outerwear and apparel. For more than 30 years, the company has pioneered the development of environmentally-conscious and innovative outdoor performance products and manufacturing techniques.", "rolex": "", "calvin klein underwear": "As one of the world’s leading designer underwear brands for men and women, CALVIN KLEIN UNDERWEAR is known across the globe for provocative, cutting-edge products and marketing campaigns, consistently delivering innovative designs with superior fit and quality. Offerings under this label include men’s and women’s underwear, women’s intimates, sleepwear and loungewear. ", "accessorize": "Accessorize is a British brand whose first store opened in 1984 in Covent Garden, London. Since the launch of Accessorize, the brand has presented a collection of eclectic global themes, combining traditional and trendy inspirations with intricate attention to detail and a captivating injection of colour and vibrancy. Accessorize has always been about creativity and quirkiness. It offers a giant dress up box of seasonal colour where women can indulge in a spontaneous, guilt-free shopping experience. Always at the cutting edge of fashion, the eclectic bazaar in Accessorize is the perfect place to find that “extra something” to give an outfit added impact. A journey to the store takes you on a trip through a magically diverse world of accessorizing.", "the north face": "THE NORTH FACE, a subsidiary of VF Corporation, was founded in 1966. Headquartered in Alameda, California, the company offers the most technically advanced products in the market to accomplished climbers, mountaineers, snowsport athletes and explorers.", "pennyblack": "PENNYBLACK’s collection has reflected today’s quintessential “femininity and dynamism” since its establishment in 1978 in Italy. Its brand philosophy called for the creation of “enhanced dressing pleasure”, offering a series of products that fully match their accessory line. PENNYBLACK is replete with a real sense of joy and Italian taste.", "nicholas &amp; bears ": "A leading European-inspired fashion brand, Nicholas & Bears has harnessed its unique insights and classical design skills to create wearable works of art for boys and girls aged up to 16.", "anteprima wirebag": "A bag that becomes a woman’s best friend, always faithful on her wrist or shoulders. A companion that, like herself, is always ahead of fashion but never out of style.\n\nA bag that creates a spotlight, and brings cachet to the arms it belongs on. One of the materials ANTEPRIMA has been working with is an exclusive wire manufactured in Italy, crafted in a wide range of colours and knitted into lightweight wire purses that gleam with just a hint of light. The bag that became an instant hit in 1998, and has since evolved fashion icon status.\n\nA bag, dressed in new variations in hue and shape, from season to season. Lighting up the fashion world, on the side of modern women with the duality of the go-getter and the playful. Handbags spun in a matrix of hi-tech materials and timeless craftsmanship.", "optical 88": "Optical 88 owns the largest professional optical retail network in Hong Kong. Being the dealer in a variety of international brands, Optical 88 offers a broad and diverse choice of product types and styles. Apart from this, the stores are furnished with advanced eye inspection equipment and managed by registered optometrists. The high-quality products and customer-oriented services have helped Optical 88 not only gain customers' praise and support, but also recognition as a leader in the industry.", "scotch &amp; soda": "Scotch & Soda is inspired by the world and curated by Amsterdam. A team of passionate discoverers and collectors, scouring the globe for that painting, poem, vintage piece, ruin, or artefact that fuels a never-ending curiosity. Treasures uncovered on worldly wanders are poured into collections and signature looks that clash eras, classics, and places of inspiration, meshing unexpected fabrics and patterns.\n\nScotch & Soda has over 160 stores and can be found in over 8000 doors, including the finest global department-stores and independents, as well as our webstore. ", "ashworth": "Established in California of U.S.A. in 1987, Ashworth develops a full line of men’s and women’s golf apparel and casual merchandises with function and quality. Ashworth's function and fashion apparel best fit you, as a golf and style lover, who pursuits passion for life.", "tic tac time": "Tic Tac Time is the authorized watch retailer of various international brands. With the aim to provide customers the best watch buying experience and watch service to its customers, Tic Tac Time offers high quality watches with competitive price.", "joy &amp; peace": "Joy & Peace has been an emblem of quality European footwear, serving our prestigious Joy & Peace ladies with Italian finecraftsmanship.Behind every design, Joy & Peace brings special memories of joy, love and peace while journey through life with its footwear, bags and accessories.", "oysho": "OYSHO belongs to the Inditex Group and was created in 2001. It shares its form of management and fashion philosophy, Collections are renewed as fast as trends, offering clients a quality product and design.\n \nSince 2001, besides the corsetry and lingerie line, OYSHO has created new product families to complement its brand concept, such us: Homewear, Weekend wear, Gymwear, accessories and footwear.\n \nOYSHO is a brand with a young and modern spirit that adapts fashion trends to all its collections. Therefore, OYSHO markets fun, sexy and feminie underwear, comfortable and casual homewear and original accessories and footwear. Its proposals are tuned into the spontaneous personality of its clients, whose style is always mirrored by their clothes.\n ", "polo ralph lauren": "Authentic and iconic, POLO RALPH LAUREN Men’s Collection is the original symbol of the modern preppy lifestyle. Combining classics and time-honored haberdashery with downtown styles and All-American sporting looks, Polo sportswear and tailored clothing present a one-of-a-kind vision of menswear that is stylish and timeless. Polo’s signature aesthetic — along with its renowned polo player logo — is recognized worldwide as a mark of contemporary heritage excellence.\n \nPOLO RALPH LAUREN Women’s Collection is the new symbol of personal expression for the modern woman. A romantic bohemian with a cool sportiness, Polo mixes iconic all-American style with an eclectic downtown edge, all put together with individual flair. From sophisticated tweeds and simple black dresses to rugged outdoorsy looks, Polo Women represents easy, energetic style — free-spirited and cool.", "city chain": "City Chain has introduced multi-branded contemporary lifestyle watches with a comprehensive portfolio of international watch brands, targeting the diversified needs and tastes of customers. City Chain also provides actively the professional after-sales and maintenance services to furnish all-rounded services.", "alexandre zouari": "Founded and masterminded by France’s celebrated hairstyle-maker Mr. Alexandre Zouari, luxury hair accessory brand ALEXANDRE ZOUARI debuted its first collection in 2008. Handcrafted by top-class French & Italian artisans, the brand’s hair accessories create with noble materials from Europe --- embroidery lace, sheer chiffon, silk organza, soft nappa, mink etc., embellished tastefully with Crystals from Swarovski. ALEXANDRE ZOUARI boutiques are spanning across Mainland China, Hong Kong, Macau, Taiwan, Japan & Dubai, bringing a world of glorious hair accessories to the most discerning customers.", "giordano ladies": "Giordano Ladies believes \"to be truly beautiful is to have great sytle\". At Giordano Ladies, great style means bringing out and enhancing the inner beauty in every one of us through simple, modern classic, timeless clothes. It's whats we really wear, what we put on when we don't need to impress anybody, be anybody - that give us comfort.", "mabelle ": "MaBelle was the first retail chain in Hong Kong to offer customers set-price, \"value-for-money\" diamond jewellery. She has been endeavoring in different innovations over the years to provide customers with unique shopping experience. Having owned the most extensive retail network, MaBelle is the market leader in diamond jewellery retail business in Hong Kong. In 2012, MaBelle proudly present, the “Free Professional Ear Piercing” service.", "kent &amp; curwen": "Kent & Curwen is a jewel of British menswear reborn for the 21st century.\n\nCreative director Daniel Kearns, in partnership with David Beckham, has established a new blueprint for Kent & Curwen: a fresh take on English heritage for the way men dress today.", "apm monaco": "Influenced by Monaco and the South of France, APM Monaco is a much loved contemporary fashion jewellery brand with a touch of Monegasque flair.\n \nNamed after founder Ariane Prette, APM Monaco was created in 1982 and made her mark first in producing pieces for many great names in the jewellery business.\n \nAfter 30 years of developing and perfecting traditional handcrafted quality jewellery, the Prette family decided to venture into the design-focused jewellery business and continues to carry on Ariane's legacy with the aim to make APM Monaco not only a household name but one that is modern yet timeless and fits perfect with current market trends.", "cos": "COS is a fashion brand for women and men who want modern, functional and considered design.\n \nOffering reinvented classics and wardrobe essentials, COS creates pieces that are made to last beyond the season, merging traditional methods and new techniques to form timeless, understated collections.", "les néréides ": "Together, we created Les Néréides with one simple vision: do what we love, and do it to the best of our ability, in order to share our passions and motivations with the rest of the world.\" -Pascale & Enzo Amaddeo\n \nLes Néréides is a family story that comes from the heart; a story that we have been writing since 1980. Travel with the founders Pascale and Enzo and discover our amazingly realistic jewelry where beauty appeals to all the senses.\n \nDiscover our floral themes where the beauty of the flower is immortalized in all its freshness and also our animal themes where the most fascinating species sparkle in their environment. You can also let yourself be guided off the beaten tracks and into an ever more avant-garde territory with our special themes or find our timeless iconic themes tinged with elegance.", "max &amp; co.": "Founded in 1986, MAX & Co. conceives dynamic, varied and savvy collections on materials, fabrics and details. Smart, fresh, affordably luxurious collections in which creativity and quality are constant values. A free, extensive creativity and design for clothes and accessories to mix and match in a personal, individual and dynamic way.", "ps by paul smith": "Paul Smith is one of Britain’s leading fashion designers and renowned for his idiosyncratic take on traditional British styling - 'classic with a twist'. He has the ability to anticipate and spark trends, not only in fashion but often in the wider context of popular culture.\n\nIn recognition of his dedication to British fashion, he was knighted in the 2001 Queen’s Birthday Honours list for services to the Industry and remains fully involved in his business.   There are over 150 Paul Smith shops around the world. This year, in addition to Mainland China, Paul Smith is opening new shops in Amsterdam, Melbourne, Moscow, Mumbai and Singapore.", "links of london": "Founded in 1990, Links of London has quickly established a reputation for beautifully crafted affordable luxury jewellery and gifts. Links of London won awards than any other brands. Links of London won UK Jewellery Brand of the Year in 2005, 2006 and again in 2007. The brand was described as “A clever brand that hits every marker. The wealth of appeal is astonishing”. Their product range includes men’s and women’s jewellery, watches, accessories and gifts.", "montblanc": "Montblanc has been known for generations as a maker of sophisticated, high quality writing instruments. Now, it has been the philosophy of the brand to combine handcrafted Swiss watchmaking with state-of-the-art technology in order to create an outstanding watch masterpiece. In 2008, Montblanc presented its first own in-house movement, which marked a further milestone in the success story of Montblanc watches.\nThe product range has been expanded to include exquisite writing accessories, watches, jewellery, leather goods etc. Montblanc has thus become a purveyor of exclusive products which reflect the exacting demands for quality design, tradition and master craftsmanship.", "georg jensen": "Georg Jensen, the Leading Scandinavian Luxury Lifestyle Brand founded in 1904 when silversmith and sculptor Georg Jensen (1866-1935) started his workshop in Copenhagen. With more than 100 years of tradition and experience, Georg Jensen is today globally recognized for the unique Scandinavian design language, outstanding craftsmanship and superior quality. Georg Jensen is offering the best of Scandinavian design with a wide product assortment from jewellery, gold, silver, watches and hollowware, flatware, home ware and Christmas decorations to gift articles. It’s pure, elegant Scandinavian design style is favoured by millions of discerning consumers around the world and is often quoted as one of Denmark’s most recognized brands.", "i.t": "As being well recognized for its unique styles, extensive selection and trend-setting role in Hong Kong, I.T Festival Walk houses worldwide designer labels including Maison Martin Margiela, Gareth Pugh, TSUMORI CHISATO and many more.", "sportmax": "Symbolizing the young and fashion forward, SPORTMAX was conceived in 1969 as a contrast to the smart and tailored tradition of Max Mara. The genesis of SPORTMAX came from an English spirit and youthful eclecticism of swinging London of the era. Over the years, the brand has synthesized important fashion trends with an international flair, gearing towards women who passionately follow and appreciate the evolution of style. SPORTMAX collections are designed for women of determination, confidence and joie de vivre. The SPORTMAX woman constantly seeks out the best and the most beautiful.", "double-park": "double-park is a multi-brand new format conceptual retail store established in 2000. double-park combines various trendy elements such as music, sport, dance and innovative ideas, offering customers a new source of glancing the hip yet quality wear labels in a flash.\n fingercroxx, a house label available at double-park, centers on print design and fabric selection, on top of which details and features of innovative functionality are incorporated to create quality and stylish casual wear; which has founded fingercroxx’s leading status among street fashion labels alike.", "omega": "", "bookazine": "Bookazine, Hong Kong’s most successful chain of bookshops, is a family run business that was established in 1985. They carry all the essentials for busy working parents and shoppers: best-seller books, the most popular international magazines, cards, toys, party supplies and sweets.", "dbs treasures centre": "The DBS Treasures Centre at Festival Walk is a facility blended with Asian delights and new look. No matter if customers are here for exploring investment opportunities or exchanging currencies for travelling, their staff will present highest standard of service to making their stay a memorable and refreshing one. Now one can truly enjoy the wealth of treasures.", "guerlain": "Founded in 1928, Guerlain integrates noble raw material, advanced research and extraordinary sensuality to create a luxury cosmetics brand mixing fragrance, skincare and makeup.", "nail nail": "Established in 2000, NAIL NAIL Group is an ingenious nail salon inspired by nature and passion. Its concept is an elaboration of the popular American nail bar. They create nail beauty and deliver essential nail care services of manicure, pedicure, hand and foot care treatment, and artificial nail services which using high quality products also host the opportunities of artistic self-expression with the work on special Organic Calgel, GELeration LED Gel Polish, the luxury 1 carat diamond inlay and masterful nail art.", "kiehl’s ": "Founded as an old-world apothecary in New York City since 1851, Kiehl’s unique and extensive background represents a blend of cosmetic, pharmaceutical, herbal and medicinal knowledge developed and passed on through the generations for 160 years. At Kiehl's, all products are made with the finest natural ingredients in their unique formulations to assure the high quality of skin care, hair care and body care.", "chanel beautÉ": "CHANEL BEAUTÉ welcomes you to discover the ultimate luxury of skincare, makeup and fragrance products served by a specialized team of beauty experts.", "lancôme": "Encapsulating the time-honoured cultural DNA and effortless chic of the city of light, Lancôme from Paris wows people with its newly renovated store at Festival Walk! The world’s first-ever Lancôme concept store opened in 2003 at Festival Walk now taps into Parisian apartment for inspirations and transforms the breezy Atelier style into a refreshing shopping experience.\n            ", "i private i salon": "i PRIVATE i SALON occupies 6,000 sq. ft. with avant garde interior design and spacious environment. There are three corners for customers to enjoy their unique experience in a salon: the quarter of vogue, the fun land for kids and the renowned NAIL NAIL section of the company group.", "jo malone london": "Quintessentially British. An understated style. Timeless and elegant...infused with charm, wit and whimsy. These British qualities are the heritage and heart of Jo Malone London,a name synonymous with style.  \n\nEnter The World of Jo Malone™ and discover British bespoke fragrances, From new-on-the scene scents such as Mimosa & Cardamon, to the original modern classic and Lime Basil & Mandarin.  Each fragrance crafted from the highest quality ingredients, tailor-made and exquisitely simple,but always a little unexpected.\n \nOur boutique mixes English classicism with modernity. From advice on styling a scented statement to finding a special gift, creating an environment where shopping becomes an inspiring experience.", "fancl ": "Founded in 1980, FANCL pioneers the “Preservative-free” skincare philosophy, and stands firm on using no preservative and stimulating addictive in its products. Consistent with its concept of “Inner and Outer Beauty”, FANCL has also developed and produced a series of safe and effective health supplements and health foods.\n\nFANCL store is equipped with state-of-the-art devices, offering free skin and health analyses. Professional beauty consultants provide tailored skincare and health program, giving the most caring and exclusive service to each customer.", "mannings": "Mannings is a member of the Dairy Farm Group and is Hong Kong’s leading health and beauty chain with more than 330 stores, territory-wide. Mannings offers 100% genuine product guarantee, putting consumer rights first and provides a high quality, comprehensive range of Health, Personal Care, Skin Care and Baby Care products.", "bank of east asia": "The Bank of East Asia’s Festival Walk Branch provides a comprehensive range of banking and financial services.  A wide spectrum of highly personalised wealth management services including investment funds, linked deposits, securities trading, currency trading, insurance, consumer loans, mortgage loans and much more. The advanced “i-Teller” booths enable customers to perform banking transactions with BEA Customer Service Representatives via video call.", "giorgio armani beauty": "To make a perfect match with his premium fashion, Giorgio Armani, the “Master of Beauty”, founded his own luxurious cosmetic brand with supreme and highly-professional products in makeup, skincare and fragrance render the brand a unique position in the beauty market.", "aveda": "AVEDA merges the science of performance-driven, plant-based hair, skin and body and lifestyle products with the art of the high-touch experience, to offer a comprehensive menu of treatments for head-to-toe beauty.   ", "muji": "MUJI Festival Walk Store features an all-rounded good enough living concept, offering a wide range of garment, household goods and food, together with Café&Meal MUJI and MUJI BOOKS, to accommodate different customers’ needs and provide them life inspiration for an organized living.\n \nCafé&Meal MUJI promotes the concept of \"Deli of Original Natural Flavour\". With wide range selection of seasonal ingredients, it uses simple cooking method to maintain the original taste of the ingredients, offering customers healthy cold and hot deli, dessert, special drinks and light meals, meeting the nutrition needs of people for well-balanced diet. \n \nWith the concept of \"Always lives with the Golden Quotes\", MUJI BOOKS uses books as a communication tool to incorporate into home living goods in the store to enlighten the life with discovery and hint for a comfortable living.", "nars": "At the heart of NARS is François Nars’ mission to empower women to experiment and have fun with makeup by teaching them how to enhance their natural beauty and individual characteristics. François Nars believes there are no rules when it comes to beauty; whatever makes you look and feel good is right.  NARS has the ability to be many things to many people: a stylish accessory, a guilty pleasure or a makeup wardrobe staple, but it’s a certain allure imparted by François Nars that makes NARS a state of mind and a lifestyle brand for the future.  ", "estēe lauder": "Estēe Lauder is one of the world’s most renowned beauty companies. Their skincare, makeup and fragrance products are innovative, technologically advanced and proven effective. Estēe Lauder has earned a worldwide reputation for elegance, luxury and superior quality, and their products are sold in more than 140 countries and territories. For over 60 years, they have stayed true to the unshakeable belief that inspired Mrs. Estēe Lauder to found her company in 1946: the belief that every woman can be beautiful. Today, that simple notion has literally changed the face of the beauty business. Welcome to the world of Estēe Lauder.", "beyorg | beyond organic": "Founded in 2005, BEYORG offers the world’s very best natural and organic products for face, hair, and body, including mother and baby care products, make up, nail polish, essential oils, fragrance and supplement. Facial treatments are available at Festival Walk shop. They hand pick more than 28 different brands from Germany, Austria, France, Denmark, the UK, the USA, the Netherlands and Japan. Their products are not only natural and healthy – they are state-of-the-art and highly effective, many are designed for the pregnant women and for those with sensitive skin. Several of the brands are entirely handmade and deliver clinically proven anti-aging results.", "watsons": "The Watson's at Festival Walk has reopened to offer you a brand new shopping experience! With “openness, comfort and style” in mind, this Watson's store redefines the meaning of “personal care store”. But what has remained the same are the friendly staff and pharmacists that continue to provide you with a professional, stress-free shopping environment. So what are you waiting for? Go see for yourself!", "mtm": "mTm was founded on the principle that your skin type and conditions are as uniquely individual as you are, and need a skincare regimen to match. In 1991, mTm established the region's first skincare centre to feature products and treatment services for men and women, specifically customized to accommodate individual needs. The innovative Custom-blended concept was a pioneering departure from the existing mass-produced skincare products of the time. Combining the concept of Custom-blended skincare with manufacturing technology from Japan, mTm features skincare solutions that are personalized to the specific needs of each customer. 'Custom-blended formulation. Your skincare solution‘– it’s been at the heart of all mTm does since 1991, and remains so to this day.", "jurlique": "Jurlique has been developing beauty products since 1985. It pioneered biodynamic beauty by creating superior products with ingredients from its own farm, located in the Adelaide Hills of South Australia. Jurlique creates beautifully sensorial skin care 'rituals' that maintain, preserve, restore and protect the skin - assuring that each customer attains her healthiest beauty. Its skincare products touche people on many levels, through the touch, the smell, and the nurturing properties of the pure authentic ingredients.", "challenger": "Challenger is the leading brand name in auto servicing industry of Hong Kong with a customer profile of 100% motorists who are basically the car owners. The theme of PRC – Professional, Reliable and Convenience are the backbones of their service structures, which warrant service quality and customer satisfaction to customers.", "agnès b. fleuriste ": "From the interior design, display, facade, esthetics to the wooden furnishings, everything in agnès b. FLEURISTE is decorated to conjure up a picture of the French Provence.  agnès b. FLEURISTE offers a wide range of bouquets & baskets, greenery and floral accessories, that are all perfect for heartfelt expressions at any occasions.   ", "melvita": "Melvita, an organic beauty pioneer certified by ECOCERT, born in Ardeche France in 1983. All formulas are meeting high standard of COSMEBIO, delivering high quality organic face,body, hair care as well honey and supplements. The brand is renowned for its organic floral waters and beauty oils, namely damask rose floral water and argan oil.     ", "shiseido": "Since Shiseido was found in 1872, the pursuit of ‘A Lifetime of Beauty’ has been the vision and the goal Shiseido pledges to fulfill for customer. Shiseido’s corporate philosophy of providing “hospitality” (“Omotenashi” in Japanese), has been at the heart of Shiseido since its inception, providing the most professional and premium service and beauty solution to each of their customer. Over the past years, Shiseido has remained true to this vision by offering unsurpassed products and superior service, which has been assured by support from customers and media and also by acquiring numerous beauty awards.", "eve lom": "With over 30 years of expertise, EVE LOM believes perfectly cleansed skin and long lasting hydration are the secret of true radiance: The unique formulation of iconic Cleanser, also being known as “probably the best cleanser in the world”, effectively removes waterproof make-up and deeply cleanses the skin to reveal a long-lasting, healthy glow. Strong clinical supports long lasting hydration anywhere up to 72 hours across the EVE LOM skincare collection. After all, radiance begins with balanced, hydrated skin. ", "osim": "OSIM International Limited is the global leader in branded healthy lifestyle products. OSIM has over 30 years of experience and uncompromising dedication in developing innovative and reliable healthy lifestyle products. OSIM is the name you can trust for a healthier lifestyle and overall well-being.", "hallmark": "Founded in 1910, Hallmark is the world’s best-known greeting cards manufacturer. Today, Hallmark greeting cards and gifts business operate across the US and in more than 100 countries.\n \nThrough moments big and small, and through both happy and challenging times, Hallmark helps give voice to caring thoughts and emotions with tangible reminders of appreciation, celebration, belonging and love.\n \nWe continue to innovate and develop new products & services – in addition to greeting cards – to meet changing consumer needs.", "citibank (hong kong)": "Citibank branch at Festival Walk provides a comprehensive range of global banking and wealth management services to local Hong Kong clients, as well as those living in China and overseas.\n \nAs the world’s truly global bank, their Citigold Services help clients to understand their wealth management needs through all the different stages of life. Together with the Citigold Total Wealth Advisor service, clients can enjoy tailor-made wealth management solutions enabling them to benefit from global investment opportunities and enjoy the privilege of our expert financial services.", "parsons music": "Parsons Music Group is the leading musical instrument retailer and producer in Hong Kong. The business includes musical instrument selling, education, product development and tradings….etc. Parsons Music Group was founded in 1986, they have already developed a scale operation system and built up a good reputation. They have also formed Parsons Music Foundation and Hong Kong Music Tutors Union, as to encourage and cultivate music talents in Hong Kong.", "yves saint laurent": "YVES SAINT LAURENT is a stellar array of makeup, skincare and fragrance products are showcased with carefully curated décor that epitomises the spirit of YSL. Boasting a generous retail space, the boutique invites customers to a novel shopping experience in the realm of beauty and skincare.", "bobbi brown": "“Clean, Fresh & Modern” – Bobbi Brown has continually met women's needs with high-quality products, accessible beauty & lifestyle advice. Bobbi truly believes beauty should be simple, real and approachable. Bobbi Brown's brow shaping service which is one of the signature services that can help you to shape, groom and style your brows according to your features. Also, Bobbi believes that every woman can be their own makeup artist. Its One-on-One makeup workshop will take you through every step to enhancing your best features, using a combination of key techniques and products based on your personal needs.", "fortress": "Founded in 1975, Fortress has grown to over 70 retail outlets. As a market leader, Fortress is clinging to the market trend. Fortress has always been introducing innovating and exciting new shopping experiences to customers.", "aēsop ": "Aēsop was established in Melbourne in 1987 with a quest to create a range of superlative products for the skin, hair and body. They are committed to using both plant-based and laboratory-made ingredients of the highest quality and proven efficacy – particularly those with the greatest anti-oxidant properties. Their products are available at Aēsop signature stores in many major cities, including Paris, Tokyo and New York, as well as counters in some of the world’s finest department stores.", "hsbc and premier centre": "HSBC Festival Walk Branch provides a full range of banking services during normal banking hours, as well as 24-hour automated banking services.", "bank of china (hong kong)": "", "mannings baby": "Mannings is Hong Kong's largest health and beauty products chain store, with more than 350 outlets throughout the territory, providing a wide range of quality health care, personal care, skin care and baby products to a broad spectrum of consumers. It has also been proactively providing innovative services and leading the industry to serve the needs of health and beauty for the general public. Mannings has been awarded by the Hong Kong Retail Management Association's through their Mystery Shopper Program as the \"Best Service Retailer\" for six consecutive years. Mannings has also been voted as the “No.1 Customers’ Favorite Brand\" in a customer's telephone survey conducted by Ipsos for 14 consecutive years (2004 to 2017).", "m.a.c": "M.A.C Cosmetics, the professional makeup company and makeup artist brand, brings the professional makeup products and services to customers in over 70 countries around the world. One of the most influential and popular forces in contemporary cosmetics, M.A.C is dedicated to developing the colours, products and tools that support the needs of both professional makeup artists and general consumers. M.A.C artists are the voice, spirit and living embodiment of M.A.C's products and culture. M.A.C is for all races, all sexes, all ages. Attitudinally hip, artfully irreverent, dedicated fully to the art of self-decoration and the realisation of the individual, the M.A.C attitude is best expressed by its artists, and seen and felt in its stores.", "shu uemura": "Founded and named after legendary Japanese make-up artist and beauty pioneer Shu Uemura, the brand has developed on the founder’s holistic philosophy of beautiful make-up starts with beautiful skin. With the sophisticate combination of “Nature, Science, and Art”, Shu Uemura creates collections with abundant colours and revolutionary high performance skincare and cosmetic products with plant extracts. Shu Uemura Festival Walk boutique, an open space store concept, offering personalised skincare and beauty consultation services, providing a relaxing shopping environment for customers.", "the body shop": "The Body Shop is a global manufacturer and retailer of naturally inspired, ethically produced beauty and cosmetics products. Founded in the UK in 1976 by Dame Anita Roddick, the brand now has over 2,400 stores in 61 countries, with a range of over 1,200 products. Every product is animal cruelty free and most of the products contain Community Fair Trade ingredients.", "liuligongfang ": "The first and most renowned Contemporary Chinese crystal brand. The award winning director and actress, Chang Yi and Loretta Hui-shan Yang respectively, emerged from the heyday of Taiwanese cinema to establish a glass art workshop and developed “pâte-de-verre” technique in Tamshui, Taiwan in 1987. In the past 30 years, LIULIGONGFANG has expanded into realms of LIULI LIVING, LIULI PLUX as well as LIULI China Museum. Many key pieces have landed in the permanent collections of the most renowned museums in the world, including Museum of Glass in New York, the Victoria and Albert Museum in London and the Palace Museum in Beijing. In 2005, LIULIGONGFANG received the Design for Asia Award (DFAA), which solidified their standing as one of the most influential brands in Asia. ", "joyce beauty": "Renowned as the ultimate luxury beauty destination in Hong Kong, Joyce Beauty is home to the world’s most coveted beauty brands, and the most sophisticated new products, ranging from skincare, hair care, body care, makeup, fragrance to cult at-home beauty devices. The elegant and exclusive emporium curates niche brands that are innovative, intelligent and results-oriented. It is this strict adherence to efficacy and elegance that ensures the city’s most global and sophisticated clientele return time after time.", "bang &amp; olufsen": "Bang & Olufsen was founded in Struer, Denmark, in 1925 by Peter Bang and Svend Olufsen, two innovative, young engineers devoted to high quality audio reproduction. Since then, the brand has become an icon of performance and design excellence through its long-standing craftsmanship tradition and the strongest possible commitment to high-tech research and development. Still at the forefront of domestic technology, Bang & Olufsen has extended its comprehensive experience with integrated audio and video solutions for the home to other areas such as the hospitality and automotive industries in recent years. Consequently, its current product range epitomizes seamless media experiences in the home as well as in the car and on the move.", "fresh ": "In 1991, Lev Glazman and Alina Roytbery set out to create the perfect artisanal soap. The launch of the now iconic Oval Soap Collection sparked their passion for developing products that are as indulgent as they are effective and have led to their mission of transforming everyday routines into sensorial journey. They went on to pioneer the use of natural ingredients like sugar, soy, and rice in modern day beauty treatments and continue to launch groundbreaking innovations.\n\nToday fresh is sold around the world and carries a full line of lifestyle products spanning, skincare, bodycare, fragrance, makeup, haircare, and home. In 2000, fresh partnered with luxury leader LVMH, gaining invaluable access to decades of experience and expertise in the prestige market, as well as unsurpassed research, development tools and technological advancements.", "hair": "Established in 1999, Hair at Festival Walk is a spacious, 6000 sq.ft. salon that pulsates with energy! The Hair Stylists and Technicians are all well-skilled in local and international fashion trends, ensuring clients are always kept up-to-date with the latest hairstyles and products. Hair has also participated in numerous high-profile events, including a hair show hosted by Schwarzkopf Professional at the Hong Kong Convention & Exhibition Centre; the launch of Schwarzkopf Professional in Hong Kong, Shanghai, Guangzhou, Singapore, Malaysia and the Philippines; the Miss Interline Beauty Pageant 1998; the Miss Hong Kong Pageant and Miss Chinese International Pageant (2001, 2003 to 2006, 2008 to 2012); Miss Cover Girl 2003 to 2005, and the Hong Kong Musical Play Festival 1999.", "10/10 hope ": "The spirit of 10/10 Hope is embodied in its pursuit of Healthy, Organic, Positive, and Eco-friendly beauty, bringing together natural brands of worldwide reputation to promote spiritual as well as physical well-being as the ultimate expression of beauty. Embracing the aesthetic of natural authenticity, knowledgeable innovation, and practiced skill. 10/10 Hope provides holistic beauty and skin care from head to toe while also an array of organic fragrances, aromatherapy and mother and baby products.    ", "standard chartered bank ": "Standard Chartered Bank Festival Walk Priority Banking Centre provides you with a customized priority banking service and fast automated banking services (cash withdrawals/deposits and passbook update). You are welcome to visit the banking centre to discuss your financial needs with its professional Relationship Managers.", "clinique": "Introduced in 1968, Clinique was the first ever dermatologist-created, global prestige cosmetic brand. All skincare and makeup products are Allergy Tested and 100% Fragrance Free. Clinique offers products for men and women of all ages and ethnicities.           ", "valmont": "VALMONT is renowned for its medical cosmetics background for over a century and many socialites and celebrities were fond of the VALMONT Clinique which was constructed in 1905 on the slope of a mountain surrounded by forest in Swiss. Later, VALMONT developed its own skincare line with the patent DNA, Glacial Spring Water and Swiss Alpine plant extracts. Hence, this established its reputation as anti-aging expert. Apart from home care products, VALMONT also provides full-range beauty treatments with the combination of professional practise and excellent products. It indulges customerinto an unforgettable sensory experiencefrom body to mind.          ", "j select quality life": "J Select is a multi-brand lifestyle enrichment retailer for sophisticated urban consumers in Hong Kong and China. With our J Select platform we aim to make your shopping experience more convenient than ever before.\n\nJ Select provides a wide range of products from all over the world, ranging from electronics and home appliances to beauty and health products. You can even find luxurious watches and fine wines at J Select. The one thing all products have in common is their superior quality.\n\nBy combining a diverse portfolio of premium quality products with a user friendly customer platform, hope that you will find shopping with a truly enjoyable experience.", "acca kappa": "ACCA KAPPA, the Century-old Italian expert of hairbrushes and bodycare products from Venice, achieved fame for its delicately handcrafted and high-quality brushes soon after it was founded in 1869. A historic brand reveals the Italian lifestyle, taste, culture and elegance. Four generations of craftsmen and an absolute passion for simplicity and authentic beauty that can be seen in every item produced and in every tiny detail.  \n\nAssuring the unique and elegant design and consisting the traditional style, ACCA KAPPA adheres to the principle of strict quality, providing all up to standard commodities that offer the best feeling to users.", "la prairie": "La Prairie was born on the shores of Lac Leman where a pioneering doctor discovered the key to timeless beauty. His revolutionary ideas transformed the way we age and his methods became closely-guarded secrets whispered in rarefied circles around the world. La Prairie has become a symbol of excellence, a name inextricably linked with timelessness. Made from natural riches sought deep in the ocean, precious minerals from the Earth’s core, flora indigenous only to the mountains of Switzerland and the latest technological processes, La Prairie is forever on the forefront of advanced science.", "glycel": "Established in Switzerland in 1985, GLYCEL is a leading skincare brand renowned for over 27 years, GLYCEL continues to expand a range of skincare products that are known to measurably enhance the complexion’s cell-rejuvenating abilities. Leveraging patented technologies and natural herbal extracts, GLYCEL products leave your skin cells healthier and full of vitality. Famed for its unrivalled ability to repair damaged cells and to improve fine lines, the GLYCEL brand is your guarantee of excellent anti-aging effects that will keep your face looking and feeling unimaginably young and radiant!", "zara home": "Zara Home offers a varied range of home décor collections, including bedroom, tableware, bathroom, living room, gifts and decoration, personal care items, as well as collections for infants and children; all of which are elaborately conceptualized and created by designers from different nationalities, giving the store a three-dimensional space with an extremely strong layering sense that is unconstrained, comfortable and elegant.", "clarins": "In 1956, Clarins created its first bottle of body treatment oil using plant extracts. Integrating the brand’s unique manual massage treatment, Clarins visibly brings its vision into life by helping women to create a firm, desirable feminine body. The 100% pure oil formula preserved in each bottle free the world from the prejudice and fear of using formulated beauty products, even the pregnant patrons were, and still are, amazingly pleased with them. The founding of Clarins enthusiastically came into place with the birth of the popular collection of 6 plant extracts bottles. Up to the present, the brand is still able to keep the lasting record of selling a bottle in every 10 seconds. Thereafter, all the patented and signature products inspired by the organic plants have confirmed the No. 1 position of Clarins in Europe during the past two decades.", "fotomax": "Using Fuji Digital Laser Printing system which gives more vivid and sharper photos printing from film and digital media, Fotomax also provides a full range of imaging services including Digital Imaging and Professional Imaging services as well as the sales of other imaging related accessories. With Fotomax’s unique “Total Satisfaction Guarantee”, customers can either get free re-print or cash refund for photos that are not completely satisfied.", "clean living": "Clean Living is one of the Hong Kong’s largest clothing service providers with 36 shops and a fleet of 19 service vans. The business in Hong Kong has developed to feature a variety of services including professional dry-cleaning and laundry, uniform cleaning, suede and leather cleaning, fur cleaning and cold storage, seasonal clothing storage, household items & carpet cleaning, waterproofing, special stains removal, crease keeping, handbag care, mending and alteration services. You can feel and see the advantages of using Clean Living services for your dry-cleaning and laundry needs as the company gives you the gentlest care possible so that you can enjoy your garments longer.", "l’occitane": "Founded in Provence in 1976, L’OCCITANE has been dedicated to showing off the very best South of France has to offer a unique glowing beauty while delighting your senses with quality products made of finest natural ingredients. Every day, L’OCCITANE commits to preserving the breathtaking natural environment that never ceases to amaze. Product ranges include face care, bath & body care, hair care and fragrance products.\n ", "sk-ii": "The fascinating story behind SK-II began at a sake brewery in Japan, where scientists noticed the elderly workers had wrinkled faces, but extraordinarily soft and youthful-looking hands. These hands were in constant contact with the sake fermentation process. It took years of research for scientists to isolate the miracle ingredient Pitera™, a naturally-derived liquid from the yeast fermentation process. For the latest news and in-depth information about SK-II, please visit http://www.sk2.com.", "dior beauty": "The Dior Beauty Concept Boutique Accompanied by voguish representation and exceptional quality prides itself on the ayscendent architectural blueprint and extraordinary flair. The design’s iconic splendor marks the brand’s novel voyage of assineilated beauty and irresistible charm, as well as epitomizes the integrated French beauty scverirignty of the luxurias brand.", "clé de peau beauté": "Bearing the principal of promoting top of intelligence and elegance, the luxury skincare and make up brand Clé de Peau Beauté offers their prestigious customers an elegant and comfortable spatial experience with the world’s first concept shop in Festival Walk. Apart from using the heritage of Japanese tea ceremony as the design concept behind Clé de Peau Beauté’s first concept shop, the ideas of “transmit” and “luxe” are united as one, combining together as a “translux” spatial design inspiration.", "broadway": "Broadway is today’s leading one-stop electronic and electrical appliance retail chain in Hong Kong. Broadway is committed to enhance its product range and retail experience that keeps customers abreast with a better life brought through latest technology, and ultimately be your eConsultant.", "mcdonald’s": "For a menu of timeless favourites and exciting new innovations, it can only be McDonald's, where the famous golden arches are your guarantee of a quality dining experience at any time of the day.", "chee kei": "CHEE KEI aims to keep Hong Kong tradition alive by providing an elevated authentic experience of Cantonese food.\n \nThere's a reason why wonton soup is a backbone of the Cantonese menu. Beyond being simply delicious, it is a taste that bridges cultural chasms. Locals take comfort in the familiar balance between a meaty, flavourful wonton filling, wrapped in delicately slippery skin, served in a bowl of aromatic, warm broth. For those unfamiliar with wonton soup, we take pride in introducing the hallmark of Cantonese food.", "wine shop enoteca": "Enoteca ’s sole interest lies within the quality of their wines. Enoteca offers a gamut of fine wines from France and Italy, ensuring the best selection for each and every occasion. Much meticulousness and discretion is poured into their selection of wines in the hopes that their fellow wine lovers can have a unique wine experience only Enoteca can offer. With no interest in machine-made or commercialized wines. Look at the shelf in our shops. You can see only beautiful wines of real quality in Enoteca. Be rest assured that you will find your favorite wines from your favorite regions in Enoteca. Customers’ needs always come first when it comes to service philosophy. Enoteca ensures fullest and warmest welcome, along with their professional commitment to each and every wine lover they serve. Clean shop, warm welcome with smile and small kindness. No trick, No gimmick, No magic.", "greyhound café": "Gaia group proudly brought over the hottest restaurant of Bangkok to Hong Kong at Festival Walk. It has been a great success as Greyhound soon became one of the most sought-after restaurants in town!", "king’s palace congee &amp; noodle bar ": "Core Value of King’s Palace: Conscience. King’s Palace always endeavours to bring customers “simple is the best” gourmet delicacies using the best quality ingredients, making dining experience filled with after-taste as much as ease-of-mind. Its Gourmet’s Barbecued Pork with rice is a one-of-a-kind dish that you don’t want to miss!", "wang jia sha": "Wang Jia Sha lies in its dim sum and food dishes whose authenticity can only be cooked by nationally renowned Master Chefs from Shanghai. This success formula has brought numerous accolades from food critics; without which food lovers here would not have been able to enjoy authentic Shanghainese dim sum.", "the coffee academÏcs": "In 2012, THE COFFEE ACADEMÏCS opened its doors with only one goal in mind – to redefine the coffee house experience in Hong Kong.\n\nFounded by global entrepreneur, Ms. Jennifer Liu, who believed that the Hong Kong consumer market was ready for a specialty coffee experience that can be offered only by THE COFFEE ACADEMÏCS independent group of coffee houses.\n \nFrom sourcing globally for the best quality coffee beans, to roasting onsite to finesse the inherent character of coffee and meticulously cupping to ensure quality, every molten pearl of coffee speaks of our interpretation of the perfect brew. ", "nespresso": "Pioneering the premium portioned coffee market, Nespresso embodies the luxury lifestyle values of quality, convenience and innovation and offers one of the most sophisticated espresso and coffee concepts ever developed. Our unrivalled Nespresso ‘trilogy’ unites the world’s highest quality Premium Blend coffees with smart and stylish, award-winning one-touch system coffee machines and exclusive, personalized services to ensure customers can indulge in their love of perfect coffee and experience the Ultimate Coffee Experience.", "godiva": "Created in 1926 in Brussels by Joseph Draps, GODIVA Chocolatier has become one of the most prestigious chocolate brands in the world. The recipes of their founder and their unique chocolate making process remain the secrets of GODIVA quality, leading to GODIVA’s appointment as official supplier to the Royal Court of Belgium. From the legendary chocolates and luxurious truffles, to their chocolate covered biscuits collection, coffees and chocolate drinks, GODIVA Chocolatier is dedicated to over 80 years of excellence and innovation in the Belgian chocolate making tradition. From New York to Paris, Tokyo and Hong Kong, it is GODIVA Chocolatier that brings the best of Belgium to the world.", "jasmine": "Enjoy authentic Chinese cuisine in a different way. The aroma of jasmine filled in the air. Jasmine offers a new Chinese dining experience by serving smaller portion Chinese dishes, healthy greens and tofu, a large selection of tea and home-made desserts, with no MSG added and healthy cooking method. To experience Chinese food in a different way, one should start from Jasmine.", "house of canton ": "Delectable Cantonese specialities and exceptional value making House of Canton a popular venue for customers of all ages.", "queen’s café": "Savour the elegance of authentic Russian cuisine at Queen's Café – a unique venue beloved by generations of Hong Kong diners.", "mad for garlic": "Mad For Garlic is a living tribute for delightful garlic-themed dishes, served within a modern Italian wine bistro experience with a Korean twist. Since its launch in 2001, Mad For Garlic has become one of Korea’s most successful restaurant chains with 38 locations in celebration of the country’s love and knowledge of garlic. Using top-grade crops from the protected and certified farm region of Changnyeong-gun, Mad For Garlic’s delectable Italian-inspired classics perfectly complement its striking interior, carrying the charm of a rustic tavern or wine cellar with shades of timeless, contemporary style. Nearly 90%of our dishes are incorporated with garlic, from appetizers to desserts, bringing a unique dining experience to Hong Kongers.", "ciao chow": "Ciao Chow-Italian Cafeteria features the first AVPN-certified Authentic Neapolitan Pizza in Hong Kong and daily made in-house fresh pasta.", "mccafé": "Travelled from Australia to Hong Kong. McCafé aims to provide a relaxing space for the bustling people in town to enjoy the best coffee. Besides the signature Cappuccino, McCafé’s Frappe, Crayfish Mango Sandwich and Macadamia Mango Cheesecake are equally wonderful, creating a satisfying taste to customers.", "tamjai samgor ": "“TamJai SamGor Mixian” is the most famous Mixian specialist in Hong Kong. Sam Tam, the trend-setter of spicy Mixian, not only introduces “Hot & Numbing soup” to Hongkongers, he also brings in lots of unique snacks such as “Hunan Cumin Chicken Wings”, “Sliced Pork Belly with Mashed Garlic” & “Preserved Duck Egg with Green Chili Pepper” to food lovers. “TamJai SamGor Mixian”was one of the MICHELIN guide “Bib Gourmand Restaurants” from 2011 to 2013.", "simplylife ": "Founded in Hong Kong in 2007, simplylife serves freshly baked European style handmade bakery products and simple food. Less is more at simplylife. We practice our mantra of doing fewer things well by combining the freshest ingredients with our unique style of cooking expertise.\n\nOur cake room at Festival Walk is placed in full view of our guests, behind a waist to ceiling glass window next to the entrance. Here, expert bakers beautify each cake only with the freshest ingredients; every cake is a superb piece of craftsmanship. Fresh trays of the renowned croissants, danishes and sumptuous fruit tarts are served right out from the oven several times a day and are the perfect treats for all hours of the day.\n\nBeyond the bakery, simplylife's open kitchen is busily serving a range of salads, handmade pastas, burgers, pizzas and other hot meals. The aroma from the cooking, baking and coffee brewing brings out a true dining experience of a roadside European café.", "ana gura": "ANA GURA proudly presents the premium Japanese Cuisine in Festival Walk. Along with all seasonal and fresh ingredients, the feature bar tables of Tempura and Sushi stages chef's most exquisite cooking technique. Don't forget to try the other signature delicacies such as Teppanyaki and Grilled Dishes. The completed \"food journey\" in this cozy and modern atmosphere will just melt your heart and soul.", "häagen-dazs": "The philosophy of Häagen-Dazs™ is simple: find the purest and finest ingredients in the world and craft them into the best ice cream and sorbet available, it is a way of doing business that is as demanding as it is uncommon. And it is the reason why the brand has epitomized fine ice cream for nearly half a century.", "sake diamond": "Sake Diamond is a wine store with a variety of stylish hand-made wines. The founder is a sake import pioneer.  They have passion and sincerity in the sake more than ten years, and selected each sake carefully. There are more than 130 kinds of sake in the store, and some of them are also sold exclusively in Hong Kong. In addition, there are also whiskey, plum sake, mandarin sake and fruit sake, which are also popular among Hong Kong people.", "gyu-kaku ": "With more than 600 branches in Japan, Gyu-Kaku Japanese Yakiniku Restaurant has commitment to offer yakiniku at reasonable prices with excellent atmosphere and high-quality services.", "see’s candies": "Founded in California in 1921, See’s Famous Old Time Candies has since been a renowned chocolate brand for over 90 years. Flown fresh from California, See’s Famous Old Time Candies has more than a hundred different varieties of delicious chocolate fillings, including delectable chocolate covered crunch whole nuts, creamy smooth fruit centers, buttery brittles and sinfully rich truffles. Its special gift box selections and assortment packs are perfect for gift-giving or as a special treat for yourself.", "an nam": "Since 2013, Vietnamese fine dining restaurant An Nam has been mesmerizing people’s taste buds with authentic Vietnamese cuisine.  Led by our executive chef with over 40 years of culinary experience, the spacious 5,800 square feet flagship store combines nostalgic Indochine interior with top-quality Vietnamese cuisine for a mouth-watering journey on the palate. ", "oliver’s super sandwiches": "Using the British neighborhood café as a blueprint, Oliver’s Super Sandwiches (Oliver’s) has started a whole new café concept in Hong Kong. Oliver’s is one of the founders and pioneers of the European-styled café in the industry. Oliver’s provides all kind of fresh ingredients for our customers to let them create their desired sandwich. Besides, the baked potatoes, is one of the most favorite selections in the menu. Oliver’s belief “Eat is Your Life” will further appeal our present customer’s tastes and expectations. ", "tai hing": "Tai Hing is the largest Hong Kong-style restaurant group, combining traditional and modern elements. Tai Hing has diversified to include in its menu roasts, milk tea, Western dishes and Chinese stir-fried dishes.", "tenrens tea ": "", "café&amp;meal muji ": "Café&Meal MUJI  promotes the concept of \"Deli of Original Natural Flavour\". With wide range selection of seasonal ingredients, it uses simple cooking method to maintain the original taste of the ingredients, offering customers healthy cold and hot deli, dessert, special drinks and light meals, meeting the nutrition needs of people for well-balanced diet. ", "on-yasai": "Origins from Japan with more than 300 branches, the Japan No.1 Shabu Shabu, ”On-Yasai” offers the best quality ingredients from all over the world, including Japanese Wagyu beef, Kumamoto Pork together with Japanese imported vegetables as well as special soup bases for customers to enjoy the plentiful Shabu Shabu experience.", "pepper lunch": "Pepper Lunch is an affordable DIY fast food steakhouse with more than 200 outlets in Japan. Pepper Lunch promises a dynamic and fresh culinary experience for everyone by presenting the novel concept of a sizzling steak. You can enjoy juicy steak with a sizzle at affordable prices.", "cova cake-chocolate shop ": "Design of the expanded COVA Cake-Chocolate Shop at Festival Walk carefully bears the historical Italian identity of its motherhood establishment in Milan, and playfully infused with contemporary interpretations.The COVA Cake-Chocolate Shop continues the showcase of sumptuous fresh cakes, pastries and renowned chocolates & confectioneries that air-flown direct from Milan.", "cova caffè ": "Design of the expanded COVA Caffè at Festival Walk carefully bears the historical Italian identity of its motherhood establishment in Milan, and playfully infused with contemporary interpretations. Using only the freshest and prime ingredients, its menus skillfully reveal the philosophy and the Art of Italian Gastronomy - “Simple, Fresh, and Elegant”.  The adjacent COVA Cake-Chocolate Shop continues the showcase of sumptuous fresh cakes, pastries, and renowned chocolates & confectioneries that air-flown direct from Milan.", "exp ": "Life is short, let’s eat and play.\n \nEXP welcomes friends and families with a crisp and vital atmosphere. The colourful fruit stall at the entrance boost everyone’s appetite and spirit, while the aromatic pizza arena and the dynamic open kitchen complement the dining experience with liveliness. For hungry yet energetic diners, the rink-side ice skate friendly dining area is perfect for a quick recharge.\n \nNew elements are also injected into EXP’s offerings. The cold pressed mixed juices made of fresh fruits and vegetables preserve richer nutrients, while alternative pizza toppings such as pumpkin and chestnut, dessert like freshly baked puff cake are here for greater diversity. A variety of appetizers, pastas, rice and noodles is ready to satisfy diners at any age.", "petite house": "At PETITE HOUSE all products are fresh and prepared daily by our professional staff. The highlight of our range of products is our Italian-style gelato made with fresh, selected ingredients, from recipes that contain low fat and low sugar.", "lady m new york": "Known for the Signature Mille Crepes Cake, Lady M has been considered as one of the finest and most celebrated patisseries in New York City. Lady M prides itself in creating the freshest and finest cakes, the most exquisite and high quality confections that are handmade by dedicated pastry chefs with the finest ingredients.       ", "teawood café": "Devoted to serve the genuine Taiwanese food and beverage, TeaWood firstly launch a new brand named “TeaWood Café\" in Festival Walk. It serves a range of Noodles, Snacks and Drinks like Cold Brew Tea, Au Lait, Salted Cream, Fruit Tea and Coffee, with the concept of heathy takeaway meals.\n\nWith the interior design theme of “TeaWood Jungle\" customers can enjoy the scenery outside through the floor-to-ceiling windows. It is like a place to relax in the woods!", "sift": "Sift, a truly modern patisserie driven by an exclusive passion to bring the most refined, gourmet cupcakes, French pastries, macarons and cookies to our customers.  We source the world over for the highest quality ingredients; whether it be our Madagascar bourbon vanilla, Valrhona and Callebaut chocolate products or dairy imported from France, we believe in using the very best.  Every item is flavoured with all-natural ingredients, real strawberries, cherries, etc.  flown in fresh to guarantee the most pure and unadulterated of flavours.", "dan ryan’s chicago grill": "Dan Ryan’s Chicago Grill promises culinary passion everyday and a heartfelt commitment to guests, with the obsession of delivering a modern American dining experience and enhancing your lifestyle during your visit.  A hip urban American inspired atmosphere combines with 1960’s jazz music, outdoor café settings and open bars. All these elements allow you to enjoy an upscale, lively and relaxing environment and a little piece of the Chicago lifestyle.", "yoshinoya": "Founded in 1899, Yoshinoya is a famous Japanese beef bowl (Gyudon) specialist with a well-established history of over a century. After over a hundred years’ continuous development, Yoshinoya now has over 1,700 branches around the globe, spanning from Beijing, Shanghai, Hong Kong, Singapore to California, US and Malaysia etc., it continues to provide Japanese style quality food and services to customers around the world.", "pacific coffee ": "Pacific Coffee is a hassle-free place to meet, relax and chat. They aim to serve great Italian espresso based coffee in generous American sizes. Come and explore the unique coffee experience with Pacific Coffee – your affordable luxury.", "garrett popcorn shops": "Garrett Popcorn Shops is the original handcrafted gourmet popcorn company.", "starbucks coffee": "Starbucks made its debut in Hong Kong in May 2000. Over the past decade, Starbucks is committed to creating the third place for customers, the most comfortable destination after home and office. We bring the unique Starbucks Experience to life for every customer through every cup. Our partners are passionate to brew a perfect cup of coffee for our customer to enjoy in a cozy ambience.", "sen-ryo": "At sen-ryo, we serve you the finest, most authentic sushi in town, made using the traditional Edo-mae technique. Feel at home and let the enticing taste of sushi greet you, with warm hospitality and great prices!", "a-1 bakery &amp; châteraisé": "", "j.s. foodies": "Introduced to Hong Kong for its very first time by i.t blue block, J.S. FOODIES is a restaurant chain founded by Japanese fashion label JOURNAL STANDARD. Borrowing the simple, clean interior design from its Japanese counterpart while also employing subtle elements of industrial chic, the spacious restaurant will make diners feel at home. J.S. FOODIES specializes in West Coast-style American burgers and pancakes. All of its pancakes are made to order with Japanese eggs and flour, and boast a rich, buttery fragrance and a soft and fluffy texture. It also offers the signature Kiseki Pancakes from popular pancake-maker FLIPPER’S.", "the night market ": "The Night Market – A contemporary dining eatery offers authentic Taiwan flavours with a modern twist. Ranging from street food to classic flavours, all dishes are 100% flavour-fuelled with fresh ingredients and MSG free.", "m&amp;s food": "Established in 1884, Marks & Spencer (M&S) is one of the UK’s leading retailers.M&S is committed to making every moment special for its customers, through its high quality, clothing and food that it offers in over 1,463 M&S stores worldwide and online. ", "tong tong town": "Tong Tong Town, the name comes from the Cantonese. Tong Tong Town is the place for all age of family to enjoy the classic Cantonese cuisine with a nice cup of coffee to enhance the dining experience.     ", "venchi ": "Premium chocolatier Venchi was launched in Italy over a century ago in 1878. The young founder Silvano Venchi is committed to using only natural ingredients. With his devotion to freshness and quality, Venchi has developed a series of exclusive and popular chocolate recipes to create chocolates of the best quality, and has since then produced over 250 types of chocolates. Until today, Venchi has a distribution network of over 6000 shops in Italy and around the world, well-received by sweets lovers in Japan, USA, etc. Venchi launched its first shop in 2011, and is now offering chocolate, gelato, and coffees.\n \nVenchi has been expanding its expertise to include other confectionary products. A collection of all-natural gelato was launched in 2007, and has been a favorite of health-conscious ice-cream fans since Venchi’s gelato are free of chemical additives. ", "café de coral": "Café de Coral provides customers with various dishes of Chinese and Western style, ranging from baked rice and spaghetti to Chinese BBQ and Steak Sizzling Plate. New menus are launched from time to time to satisfy customers’ changing needs. Apart from food quality, Café de Coral values customer services. Their staff are trained to provide heartfelt service to customers to create a-hundred-points dining experience.", "amaroni’s ": "Amaroni’s represents the most up-to-date tastes of generations perfecting delicious modern food and drink of an authentic New York Italian and Café. Offering delectable New York Style Pizzas, generous portion of Pastas, fresh daily imported Seafood and savoring Desserts to satisfy your taste buds!\n\nAmaroni’s brand new interior design truly showcases the contemporary New York lifestyle dining experience with exquisite café tables, Seafood and Wine bars. The perfect venue for friends and family gathering!", "kee wah bakery": "Kee Wah Bakery first started as a small neighbourhood grocery store on Shanghai Street in Yau Ma Tei in 1938. With the hard work of its founder, Mr. Wong Yip Wing and his workers, the business has expanded from bridal cakes, to mooncakes, to traditional seasonal products, and to other Chinese local favourites. Today Kee Wah Bakery has become a globally renowned traditional Chinese bakery brand, and a top souvenir of choice for Hong Kong and its visitors."}