[
{"Website": "", "Name": "1O1O", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/cc4e3bfe46f1ce54a464b12ead1ee079.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/1o1o", "Phone": "26041010", "Opening hours": "11:00-22:00", "Description": "1O1O is a leading local mobile communications brand offering a superior customer experience complemented by premium value-added services. 1O1O believes in deriving pleasure from ongoing discovery of the finer things in life and provides helpful tips and opportunities to live life to the full."},
{"Website": "", "Name": "CALVIN KLEIN JEANS", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/498ea1a336e6b031e9202460df7843c0.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/calvin-klein-jeans-en", "Phone": "26034229", "Opening hours": "11:00-22:00", "Description": null},
{"Website": "", "Name": "BOSE", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/59464c31098881561325af9cb1c3ff12.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/bose", "Phone": "34228298", "Opening hours": "11:00-21:00", "Description": "Bose Corporation was founded in 1964 by Dr. Amar G. Bose, then a professor of electrical engineering at the Massachusetts Institute of Technology. Today, the company is driven by its founding principles, investing in long-term research with one fundamental goal: to develop new technologies with real customer benefits. Bose® innovations have spanned decades and industries, creating and transforming categories in audio and beyond."},
{"Website": "", "Name": "CALVIN KLEIN PERFORMANCE", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/6ca7e4ff2b010f7c30aea76375a31b34.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/calvin-klein-performance-en", "Phone": "26178990", "Opening hours": "11:00-22:00", "Description": "Our “activewear” brand CALVIN KLEIN PERFORMANCE is rooted in the heritage of the Calvin Klein Brand representing an active, modern lifestyle brand with a designer sensibility, infused with performance technology blending optimal fit and function. Our range of work out, hang out and go out products appeal to those who are constantly on the go, looking for the perfect pieces to transition seamlessly in their lives. "},
{"Website": "", "Name": "BROADWAY", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/883c39c6e3239e30c0091bf50d26318a.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/broadway", "Phone": "26067762", "Opening hours": "11:00-22:00", "Description": "Broadway is one of the largest electrical appliances retail chain stores in Hong Kong. We offer a wide variety of world’s leading brands of Mobile Phone, Camera & Digital Camera, Notebook, PDAs, Digital Video Camera, Audio-Visual Products and Home Appliances. There are a wide range of promotions throughout the year. As a one-stop electrical appliances chain store, customers can also enjoy comphensive after-sales services include prompt delivery, product warrant and 10-day replacement guarantee, etc."},
{"Website": "", "Name": "BOBBI BROWN", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f9dc210f1b6da2204b9a5852d398af70.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/bobbi-brown", "Phone": "34279420", "Opening hours": "10:30-22:30", "Description": "Bobbi Brown believes that every woman can be her own makeup artist. She states that makeup is a way to look and feel like yourself, only through simple steps to be prettier and more confident, that’s Pretty Powerful!"},
{"Website": "", "Name": "BEYORG", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/cfb4fb8a6ede85b1bfd052324ca3c8c1.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/beyorg", "Phone": "24333398", "Opening hours": "10:00-22:00", "Description": null},
{"Website": "", "Name": "bauhaus", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/340d62bdee51eba64007d6c3d15b5f6c.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/bauhaus", "Phone": "26066915", "Opening hours": "11:30-22:00", "Description": "The bauhaus store adopts white & grey wooden materials as the main design theme of the interior to make the environment flash and comfort, walking around in store, the lighting which allows each display part to be individually illuminated, the store offers a comfortable and exciting shopping experience for both men and women."},
{"Website": "", "Name": "Bank of China (Hong Kong)", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/21df8a48a4e935f8e557f6bd2b02040b.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/bank-of-china-hong-kong", "Phone": "39882388", "Opening hours": "09:00-17:00 (Mon-Fri)\n09:00-13:00 (Sat)", "Description": "Bank of China has upheld the spirit of “pursuing excellence”  and built up an excellent brand image that is widely recognised within the industry and by its customers."},
{"Website": "", "Name": "A|X ARMANI EXCHANGE", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/47e51d2919ee7474c5574c81e98be51c.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/ax-armani-exchange", "Phone": "26810883", "Opening hours": "11:00-22:00", "Description": "A|X Armani Exchange is accessible Armani, inspired by street-chic culture, fashionable dance music and everything that signifies freedom and personal style."},
{"Website": "", "Name": "AV Life", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/943f8535f38195dbc61603ff045d3b48.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/av-life", "Phone": "26913998", "Opening hours": "11:00-21:30", "Description": "The first AV Lift Shop was opened in 2002. Within a short time, AV Life had acquired a hallmark of being caring and having professional “before-sale services” (site visits) and “after-sales services” (delivery & installation). AV Life offers a wide variety of world’s leading brands High Definition TV, Home Theater, DVD Player and Projector etc. Welcome to visit our shop to discover your ultimate and prestigious shopping experience."},
{"Website": "", "Name": "Bally", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/d50f8929f31e5fc9fc6388ebebbe0d99.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/bally", "Phone": "23662588", "Opening hours": "11:00-22:00", "Description": "Bally has been crafting exquisite luxury leather goods for over 160 years and is globally recognised for its \"Swiss Innovation. Functionality. Modernity\". Since 1851, these three principles symbolise the enduring pioneer spirit of founder Carl Franz Bally – an ethos that continues to imbue this authentic Swiss brand with its visionary commitment to cutting-edge techniques and exceptional craftsmanship. Over 160 years, leather remains its medium and inspiration; a fine natural material that serves both functionality and creativity. Every product is a testament to Bally’s passion for perfection. Today, Bally is the unique Swiss luxury shoe and accessories brand."},
{"Website": "", "Name": "Aveda Experience Center", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/96c4a295b7c80f443c48cc25ecb0965c.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/aveda-experience-center-0", "Phone": "21132717", "Opening hours": "11:00-22:00", "Description": "Founded in 1978, Aveda creates plant-based hair, skin and body products for beauty professionals and consumers. Aveda innovates in botanical technologies, combining the principles of modern science and Ayurveda, the ancient healing art of India, to develop performance-driven hair, skin and body products that are created with respect for the Earth."},
{"Website": "", "Name": "ZARA", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/27fa74a5e805ebe1ac379f08c7518079.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/zara", "Phone": "26082272", "Opening hours": "10:30-22:30", "Description": "ZARA is one of the largest international fashion companies. It belongs to lnditexone of the largest distribution groups in the world. We provide man, woman, kids and teenagers wear. It would be suitable for all families. Also , ZARA provide  different kind of goods for customer choosing. Generally, ZARA is the shop which is good for family."},
{"Website": "", "Name": "YSL Beauté", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/851a75b64ed10e2d1c1567f0bf0bcb9e.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/ysl-beaut%C3%A9", "Phone": "21498979", "Opening hours": "10:00-22:00", "Description": "YSL Beauté is proud to introduce the new store opening in New Town Plaza, where a stellar array of makeup, skincare and fragrance products are showcased with carefully curated décor that epitomises the spirit of YSL. Boasting a generous retail space, the boutique invites customers to a novel shopping experience in the realm of beauty and skincare. Visit us today and enjoy various purchase privileges to celebrate the grand opening with us!"},
{"Website": "", "Name": "YATA", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/566ffe571dfc7f4a5d1782734f1353d2.JPG", "Url": "http://www.newtownplaza.com.hk/shop/en/yata", "Phone": "26941111", "Opening hours": "Sun - Thur 10:00 - 22:00 Fri - Sat & PH 10:00 - 22:30", "Description": "Yata, the modern lifestyle Japanese department store, offers a wide variety of the latest merchandise from Japan, including cosmetics products, fashion and accessories, household products, electronic appliances and food items. Here you can find the Hong Kong’s first baby restaurant, Hong Kong’s first wagyu counter and supreme Japanese produce from “The Finest Harvest of Japan” counter, which is cordially run by Japan Ministry of Agriculture, Forestry and Fisheries and Yata. Come and join us to enjoy the goodness of modern lifestyle."},
{"Website": "", "Name": "WEEKEND BY MAXMARA", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/1fdbddedc1431be2fbbf8ab0157b52d4.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/weekend-by-maxmara", "Phone": "27229685", "Opening hours": "11:00-22:00 (Mon-Fri)\n10:00-22:00 (Sat-Sun & PH)", "Description": "With its beginnings as a collection geared for the Max Mara woman at leisure, Weekend Max Mara was created in 1984 when the attitude of fashion evolved, shifting its focus into comfortable, yet stylish clothes for the everyday. Weekend Max Mara is all about casual life, comfort and informality. With its philosophy firmly classic, timeless, with an understated refinement, it is also fun, stylish and trend-conscious. Inspired by the countryside, home and family traditions, historical places, Italian gardens, to misty mornings, summer afternoons and snowy landscapes, Weekend Max Mara offers a sense of heritage blended with elegance."},
{"Website": "", "Name": "Watsons Health", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/a1e66d43806494491d9a2fa336e2f2ad.JPG", "Url": "http://www.newtownplaza.com.hk/shop/en/watsons-health", "Phone": "22844017", "Opening hours": "10:00-22:00", "Description": "Watsons is Asia’s lending health and beauty retailer, currently operating over 5200 stores – more than 1300 of which one pharmacies, in 12 Asian and European markets, including China (Mainland China, Hong Kong, Taiwan and Macau), Singapore, Thailand, Malaysia, the Philippines, Korea, Indonesia, Turkey an Ukraine."},
{"Website": "", "Name": "WATSONS", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/44d369202f2d2c4a47de6b6ae2230fcc.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/watsons", "Phone": "26066500", "Opening hours": "09:30-22:30", "Description": "Watsons has a professional team of pharmacists, dieticians, Chinese medicine practitioner, health & fitness advisors, beauty consultants, an experience mother & baby advisor and nurse."},
{"Website": "", "Name": "Victorinox", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/0d04d72a11c71678dd0038645fccaa2b.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/victorinox", "Phone": "35860182", "Opening hours": "11:00-22:00", "Description": "Victorinox was founded by Karl Elsener in the town of lbach, Switzerland in 1884. In Addition to Swiss Army Knife, which has been showcased in New York’s Museum of Modern Art since the 1970s, Victorinox also features cutlery, watches, travel gear and fragrances. Each line has its own identity and style yet they all share the core values ─ highest quality Swiss design, durability and craftsmanship at sensible price ─ for which Victorinox is legendary."},
{"Website": "", "Name": "WILSON COMMUNICATIONS", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/4e35e1d7bb857cf73d0e3ae71480c7e8.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/wilson-communications", "Phone": "27711781", "Opening hours": "11:00-22:00", "Description": "We strictly select the highest quality products and provide the best customer service. We are providing a wide range of IT products, such as mobile phones, tablets, digital cameras, handsets and other accessories. Wilson has always devoted great attention to provide high quality service to customers and be the pioneer to introduce various unique customer services, such as Trade-in service, Data transfer service and One on one service which won warm praise from customers."},
{"Website": "", "Name": "VANS", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/244a6314e42a86b0a041dbb784a8984a.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/vans", "Phone": "26871828", "Opening hours": "11:00-22:00", "Description": "VANS is the original action sports apparel and footwear brands. Committed to promoting action sports attitude, young culture, creativity and the courage to express themselves."},
{"Website": "", "Name": "Theory", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/7a38a3d5c0e6bbb7f20bfd0cc5230168.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/theory", "Phone": "28815058", "Opening hours": "10:30-22:00", "Description": "Founded by Andrew Rosen in 1997, Theory revolutionized the contemporary market with its concept of the urban uniform, a modern edit of elevated essentials. A leader in Fast Retailing Group’s dossier, Theory balances luxury with accessibility in collections known for precisely tailored silhouettes and exceptional fabrics."},
{"Website": "", "Name": "Toys”R”Us", "Img": "https://ntp.shkp.com/NTP/images/img_shop/fullsize/d83b107909a6a6330828d483b4a95c3c.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/toys%E2%80%9Dr%E2%80%9Dus", "Phone": "26052225", "Opening hours": null, "Description": "Toys”R”Us is the world’s leading specialist toy and juvenile products retailer, offering a unique shopping experience with its wide range of brands and best-selling products."},
{"Website": "", "Name": "ASUS", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f4c27f106841f19d9bcbe7b01ef6703f.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/asus", "Phone": "21111702", "Opening hours": "11:00-21:30", "Description": "ASUS is a worldwide top-three consumer notebook vendor and maker of the world’s best-selling, most award-winning motherboards. A leading enterprise in the new digital era, ASUS designs and manufactures products that perfectly meet the needs of today’s digital home and office, with a broad portfolio that includes motherboards, graphics cards, optical drives, displays, desktop and all-in-one PCs, notebooks, netbooks, servers, multimedia devices, wireless solutions, networking devices, tablets and smartphones. Driven by innovation and committed to quality, ASUS won 4,368 awards in 2015 and is widely credited with revolutionizing the PC industry with its Eee PC™. ASUS has more than 17,000 employees around the globe with a world-class R&D team of over 5,500 engineers. Company revenue for 2015 was approximately US$14 billion."},
{"Website": "", "Name": "TOMMY HILFIGER", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/1b350b51efb56e4401f1c8a56ac8ebac.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/tommy-hilfiger", "Phone": "26081322", "Opening hours": "11:00-22:00", "Description": "Tommy Hilfiger is one of the world’s leading premium lifestyle brands, offering consumers a breadth of beautifully designed, high quality products including men’s, women’s and children’s apparel, sportswear, denim, and a range of licensed products such as accessories and fragrance. The brand celebrates the essence of Classic American Cool and provides a refreshing twist to the preppy fashion genre."},
{"Website": "", "Name": "Under Armour", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/b843e70567fea982d9903e70b4e07a78.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/under-armour", "Phone": "26200783", "Opening hours": "11:00-22:00", "Description": "Under Armour is the originator of performance apparel - gear engineered to keep athletes cool, dry and light throughout the course of a game, practice or workout. The technology behind Under Armour's diverse product assortment for men, women and youth is complex, but the program for reaping the benefits is simple: wear HeatGear® when it's hot, ColdGear® when it's cold, and AllSeasonGear® between the extremes."},
{"Website": "", "Name": "UNIQLO", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/9141bb7dcc1d1080f556746d843c902b.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/uniqlo", "Phone": "26061126", "Opening hours": "11:00-22:00 (Sun-Thu & PH)\n11:00-23:00 (Fri-Sat & Before PH)", "Description": "UNIQLO is the largest casual wear brand in Japan. With the goal of \"Providing high-quality products at reasonable prices and a high level customer-service\",  UNIQLO provides clothes that are soft, comfortable and easy to style, a must-have for everyone's closet."},
{"Website": "", "Name": "TSL︱謝瑞麟", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/4e7e10842fe3d96442bc55c5f6db074b.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/tsl%EF%B8%B1%E8%AC%9D%E7%91%9E%E9%BA%9F", "Phone": "28386737", "Opening hours": "10:30-22:00", "Description": "TSL | 謝瑞麟 is one of the largest jewellers in Asia. With the brand positioning of \"Trendsetting Craftsmanship\", TSL | 謝瑞麟 understands that exquisite craftsmanship and attention to details are the hallmarks of high-quality products, and is committed to offering timelessly fashionable jewellery by taking an innovative approach in product design."},
{"Website": "", "Name": "Timberland", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/54ee49fe394871a77a19458905f415b0.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/timberland", "Phone": "26989123", "Opening hours": "10:00-22:00 (Mon-Thu,Sun & PH)\n10:00-22:30 (Fri-Sat)", "Description": "Timberland is a global leader in the design, engineering and marketing of premium quality footwear, apparel and accessories for consumers who value the outdoors and their time in it. Timberland products offer quality workmanship. And are built to withstand nature's elements. Timberland products can be found in leading department stores and Timberland retail stores around the world. Timberland demonstrates a deep commitment to \"doing well and doing good\" through its \"Path of Services program\"."},
{"Website": "", "Name": "THE OVERLANDER", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/37244d888f2bfee0592b5db65d18df3a.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/the-overlander", "Phone": "34279626", "Opening hours": "11:00-22:00", "Description": "The Overlander offers a full range of product from clothing, footwear, backpack, tent, cookware, cookset, climbing gear to the expedition equipment from all around the world for the outdoor activity lovers in Hong Kong."},
{"Website": "", "Name": "the bonnie mob", "Img": "https://ntp.shkp.com/NTP/images/img_shop/fullsize/7dd5d7f57e9b39043a5e7adcddc33a36.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/the-bonnie-mob", "Phone": "21523682", "Opening hours": "10:00-22:00", "Description": "Our story began in 2005 with the arrival of a little girl called Alice-Bee, the bonnie first-born of our founder, Tracey Samuel. Although Tracey didn’t know much about parenthood back then, she did have an impressive career in knitwear design and an imagination built for creating new fabrics and textures. Tracey set about designing modern, colourful & distinctive baby-knits with the expectation that you should ‘Buy once, buy well, pass it on’. Bonnie baby was born: Practical, tough-wearing, spirited baby clothes to be loved in, played in and passed around."},
{"Website": "", "Name": "The history of Whoo / 后", "Img": "http:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/6fe4bd9377bc40dba5c86b17119ec642.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/the-history-of-whoo-%E5%90%8E", "Phone": "21112327", "Opening hours": "10:00-22:00", "Description": "‘The history of Whoo’, Korean prestige skincare brand which belongs to LG Household & Homecare, it is a modern reinterpretation of royal court secrets. It developed in an effort to comprehensively resolve problems experienced during skin aging rather than a specific skin problem."},
{"Website": "", "Name": "The North Face", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/ef18ae04023659b983df75228a61cd6f.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/the-north-face-en", "Phone": "26091110", "Opening hours": "11:00-22:00", "Description": "The North Face started to design and manufacture its own branded mountaineering outfits and equipment. The North Face that is the supplier in the United States that offer a comprehensive collection of high performance outerwear, skiwear, sleeping bags, backpacks and tents."},
{"Website": "", "Name": "SWAROVSKI", "Img": "http:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/0e69ffbb6593a9fe2f8636257de3dd76.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/swarovski", "Phone": "26998633", "Opening hours": "10:30-22:00", "Description": "Originated from Austria, Swarovski is the world's premier jewellery and accessory brand. With mastery in crystal creations, Swarovski has successfully transformed the world of fashion and beauty into a seductively sparkling universe."},
{"Website": "", "Name": "SUNING", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/cecd2f97209fa1d26f4aa08c735d56ca.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/suning", "Phone": "26969616", "Opening hours": "11:00-22:00", "Description": "Citicall was set up in 1976 .In December 2009 Citicall was acquired by Suning Appliance Company Ltd, the largest 3C electrical appliance chains enterprise in China, and named as Suning.To meet diversified customer needs. Suning has enhanced its shopping environment and store largest, established membership service and provided extended services. Suning service as its unique product and customer satisfaction as its ultimate goal."},
{"Website": "", "Name": "THE BODY SHOP", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/351463b2e6fcf6fc1a238853c14684cc.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/the-body-shop-0", "Phone": "26121711", "Opening hours": "11:00-23:00", "Description": "The Body Shop, a global retailer of toiletries and cosmetics, who commits to environmental protection and develops trading relationships with communities in need."},
{"Website": "", "Name": "Standard Chartered Bank", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/e86afdae93c66989d046893d0038020f.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/standard-chartered-bank", "Phone": "39283226", "Opening hours": "09:00-17:00 (Mon-Fri)  09:00-13:00 (Sat)", "Description": "Standard Charter's Priority Banking Centre provides customers with comprehensive, effecient, and automated banking services. The professional Relationship Managers also provide strategic financial advice."},
{"Website": "", "Name": "STACCATO", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/9f74128fb18b95ce1b0ecc7fe6b696c0.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/staccato", "Phone": "25724211", "Opening hours": "11:00-22:00", "Description": "STACCATO is an iconic fashion footwear brand which encompasses a confident sense of style. The brand traces its root to the meaning of STACCATO. “STACCATO” is a form of musical articulation, a note holds a grace melody that empowers creativity and diversity. It is known as a jumping notes symbolized as a contemporary lady who walks confidently with her high heels, and reflects an attitude of young and stylish. STACCATO commits to excite and inspire the fashionista with its edgy yet sophisticated design, and expresses the cosmopolitan working ladies with their unique style every day."},
{"Website": "", "Name": "SmarTone", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f9402e24c8d10947dfb813c7962aa703.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/smartone", "Phone": "26845678", "Opening hours": "11:00-22:00", "Description": "SmarTone is one of Hong Kong’s major mobile operators, leading the way in network performance, service innovations and customer service. Its goal is to enrich customers' lives by bringing them closer to their genuine needs, with customer-focused service proposition and unbeatable customer experience."},
{"Website": "", "Name": "SNIDEL", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/7401f71c9f16ebcb3d26e1246e181b9e.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/snidel", "Phone": "21170225", "Opening hours": "10:30-22:00", "Description": "SNIDEL is a renowned and popular ladies fashion brand established in Tokyo, the fashion capital of Asia. SNIDEL is inspired by western street-fashion and integrates casual and dignified features to disclose the youthful and playful attitudes of grown-up ladies. Targeting at smart, competent and trendy young women, SNIDEL perseveres in the pursuit of details as well as cuttings that give prominence to ladies’ alluring body lines with the aim to present quality and exceptional designs to fashion lovers."},
{"Website": "", "Name": "Sportshouse", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f32616e4e021f395f672a2a26b4577a6.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/sportshouse", "Phone": "26916856", "Opening hours": "11:00-22:00", "Description": "Since our establishment in 1985, we have been dedicated to introducing a wide range of international sportswear and casual wear brands, including adidas, BIRKENSTOCK, Converse, Le Coq Sportif, Lowe Alpine, Nike, and more, to provide customers with all kinds of apparel and gear that cater to their diversified needs."},
{"Website": "", "Name": "SKECHERS", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/de582f00278646b08254c065b5195515.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/skechers", "Phone": "26978048", "Opening hours": "10:00-22:30 (Mon-Fri) 10:00-23:00 (Sat, Sun & PH)", "Description": "Born in a small beachside California community in 1992, Skechers has grown form a one style, one building company to one of the world’s most sought-after footwear brands. An award-winning company, Skechers is now the No.2 footwear brand in the United States, second only to Nike, and was named 2009 company of the Year by Footwear Plus. This is the 4th time in which Skechers has won this award in the last 5 years. With brand presence all over the world, Skechers has close to 400 points if sales and wholesale channels in Asia Pacific."},
{"Website": "", "Name": "Sinéquanone", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/369cc49c5892ac735ebda9134714f227.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/sin%C3%A9quanone", "Phone": "26061900", "Opening hours": "11:00-22:00", "Description": "Sinéquanone style takes its inspiration from the French contemporary lifestyle. The collections are designed to meet the real desires of freedom, elegance, expressed by today’s modern women with attitudes."},
{"Website": "", "Name": "shu uemura", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/f969e002df99d0c4ec5f92abd77b8d8f.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/shu-uemura-en", "Phone": "26963325", "Opening hours": "10:00-22:00", "Description": "shu uemura, a pioneering make-up artist from Tokyo. As the definitive professional make-up artist brand, shu uemura has designed its store as interactive artist studios infused with tokyo elements, to share beauty knowledge with customers. "},
{"Website": "", "Name": "SHISEIDO", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/42fae4320e7fb05099063cbb01562e78.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/shiseido", "Phone": "2602 6702", "Opening hours": "10:00-22:00(Sun-Thu) ; 10:00-22:30(Fri-Sat)", "Description": "For over 140 years, Shiseido has defined the concept of beauty and spread its knowledge and power across the world. Heralding an army of devoted followers, we feel that by inspiring empathy, beauty can become a positive force in the world, and guide the next generation boldly into the future. "},
{"Website": "", "Name": "Sandro", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/aa3e2c6e812a8ae810c615e99d614f2d.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/sandro", "Phone": "23524328", "Opening hours": "10:30-22:00", "Description": "Evelyne Chetrite, the creative director and spirit of Sandro, draws her inspiration from streets, cities, architecture as well as the memories from her childhood in Morocco. Given her true creative spirit since her young age, it is only natural that she started a ready-to-wear brand. She founded Sandro in 1984. Each collection is designed to offer modern and sophisticated pieces with offbeat and unexpected detailing essential for every wardrobe. The Sandro silhouette is elegant and refined, with a hint of androgyny. The menswear line launched in 2008. Led by Ilan Chetrite, the son Evelyne, the menswear line is grounded in a chic, minimalist and upscale spirit, with clothes that are modern and strong. After establishing itself in France, Sandro began its worldwide expansion. Today, the house has more than 480 points of sale worldwide."},
{"Website": "", "Name": "Samsung", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/6995fdbefb1f5b6c08108ede0a28a68a.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/samsung", "Phone": "24060628", "Opening hours": "11:00-22:00", "Description": "Since its founding in Suwon, Korea in 1969, Samsung Electronics has grown into a global information technology leader, managing more than 200 subsidiaries around the world."},
{"Website": "", "Name": "SAMSONITE", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/437d0cccf7e87a0116167be46f0d9873.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/samsonite", "Phone": "26810080", "Opening hours": "11:00-22:00", "Description": "With a longstanding history of breakthroughs in luggage development, Samsonite has always been a leader in polypropylene suitcases but also continues to develop a wide range of polycarbonate products."},
{"Website": "", "Name": "Salon Beebles hair & nail", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/594fea9d83338a4cc5c58b99998fb364.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/salon-beebles-hair-nail", "Phone": "31880222", "Opening hours": "10:00-21:30 (Mon-Thu) 10:00-22:00 (Fri-Sun & PH)", "Description": "Salon Beebles by IL COLPO hair & nail is the only Hair and Nail Salon at New Town Plaza, providing professional hairdressing and nail services. We have lots of top hair stylists and manicurists. Customers can enjoy quality services and wonderful moment in our store."},
{"Website": "", "Name": "Sa Sa", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/eaaf19d1f46604f147f085e1a0d0bd39.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/sa-sa", "Phone": "26880772", "Opening hours": "10:00-22:30", "Description": "Sa Sa International Holdings Limited (\"Sa Sa\") is a leading cosmetic retailing and beauty services group in Asia. Its over 90 retail stores and counters in Asia sell more than 400 brands of skincare, fragrance, make-up and hair care products."},
{"Website": "", "Name": "REISS", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/0308d15d7fbccfa84f143d49ea6f33c7.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/reiss-en", "Phone": null, "Opening hours": "10:00-22:00", "Description": "Since its creation by David Reiss in 1971, Reiss has established a design philosophy centred on creating design-led menswear, womenswear and accessories. With an uncompromising commitment to delivering innovative and original products it fuses exceptional design, quality and value. "},
{"Website": "", "Name": "Rolex and Tudor", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/e33f4fd201a5d9db5eafe2a7e286c584.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/rolex-and-tudor-en", "Phone": "26073121", "Opening hours": "10:30-22:00", "Description": "For over a century, Rolex watches have accompanied explorers and achievers around the world. The production from the world renowned watchmaker is truely exceptional and unparalleled."},
{"Website": "", "Name": "Quarter by Tic Tac Time", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/9641b21d5701d60319b93e7ddbf83e4c.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/quarter-by-tic-tac-time", "Phone": "26963813", "Opening hours": "10:00-22:00", "Description": "Established in 1997, Tic Tac Time has become a well-known Hong Kong retail chained watch brand, carrying over 80 brands of watches like Longines, Tissot, Maurice Lacroix, Armani Exchange, Mido, Hamilton, Ball etc. With the ease of accessibility, the end-users can enjoy the tailor made and comfortable shopping experiences delivered by us."},
{"Website": "", "Name": "PUMA", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/195c7de2645720729d56d58978bcc27b.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/puma", "Phone": "24563778", "Opening hours": "11:00-22:00", "Description": "PUMA is one of the world's leading sports Brands. PUMA has established a history of making fast product designs for the fastest athletes on the planet PUMA offers performance and sport-inspired lifestyle products, it engages in exciting collaborations with renowned design brands to bring innovative and fast designs to the sports world."},
{"Website": "", "Name": "PANDORA", "Img": "http:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/2cbcf79e1506cf9c73121a5b39a0b4b4.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/pandora", "Phone": "23216300", "Opening hours": "10:30-22:00", "Description": "PANDORA was found in Copenhagen, Denmark in 1982 by Danish goldsmith Per Enevoldsen and his wife Winne. Since then, the company has made an exceptional journey from a local Danish jeweller’s shop to one of the largest and most loved global jewellery brands. PANDORA celebrates women all over the world, and inspires them to share their unforgettable moments and express their inner values."},
{"Website": "", "Name": "POLO RALPH LAUREN", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/9c9c09dd014b34b948a8436e9b2fea3f.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/polo-ralph-lauren", "Phone": "23959232", "Opening hours": "11:00-22:00", "Description": "Polo Ralph Lauren merges classic American style and urban chic, always stood for providing quality products, creating worlds and inviting people to take part in this dream."},
{"Website": "", "Name": "Playlord", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/0d7bfe6f186c98014407e5bc76995975.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/playlord", "Phone": "26931022", "Opening hours": "11:00-22:00", "Description": "Playlord was launched in 1984 and brought to Hong Kong a unique men’s designer fashion. In 1987, Playlord increased in market penetration by introducing its ladies’ feminine line."},
{"Website": "", "Name": "PINKO", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/0ee7460f59b182b21fdcf4d822a582ee.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/pinko", "Phone": "34228326", "Opening hours": "10:00-22:00", "Description": "PINKO is an Italian independent fashion brand positioned in the entry to luxury segment."},
{"Website": "", "Name": "Patagonia", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/6c92f0a06dca4f7f5997db65b3db9386.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/patagonia", "Phone": "31888138", "Opening hours": "11:00-22:00", "Description": "Founded by Yvon Chouinard in 1973, Patagonia is an outdoor apparel company based in Ventura, California. A certified B-Corporation, Patagonia’s mission is to build the best product, cause no unnecessary harm and use business to inspire and implement solutions to the environmental crisis. The company is recognized internationally for its commitment to authentic product quality and environmental activism, contributing over $61 million in grants and in-kind donations to date."},
{"Website": "", "Name": "Organic Mom", "Img": "https://ntp.shkp.com/NTP/images/img_shop/fullsize/bcbd9a4b75999f94d8d0458912cac771.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/organic-mom", "Phone": "28121167", "Opening hours": "10:00-22:00", "Description": "Korea’s number one organic kids clothing brand. Made with pesticide free organic cotton, all items are free of fluorescent, toxic free and use low impact dyes."},
{"Website": "", "Name": "OSIM", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/34994bb9e96bd371c8cc287e45968393.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/osim", "Phone": "26984611", "Opening hours": "11:00-22:00", "Description": "Established in 1980, OSIM is about the experience of total well-being. It is about living an inspiring life. We channel our Brand at each and every customer touch point, communicating our values through our innovative products, our outlet, our brand image, our service excellence and in-depth knowledge of holistic health. With our four product categories: Relax and Relief, Tone and Shape, Check and Measure, Clean and Purify, OSIM strive to cater our customers’ comprehensive needs."},
{"Website": "", "Name": "Optical 88", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/db661f0bdabf5955d382facb9f32a381.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/optical-88", "Phone": "26916124", "Opening hours": "10:00-22:00", "Description": "Hong Kong’s largest network of eyewear stores – A guarantee of quality Optical 88 owns the largest professional optical retail network in Hong Kong. With over 200 shops, our branch network spans Southeast Asia, including Macau, Guangzhou, Singapore, Thailand and Malaysia. All our stores are furnished with advanced eye inspection equipment and managed by registered optometrists. Our high-quality customer-oriented services have helped us not only gain customers’ praise and support, but also recognition as a leader in the industry."},
{"Website": "", "Name": "Onitsuka Tiger", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/e34644fdca8a78b9ac89cfd30a5c1008.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/onitsuka-tiger", "Phone": "23370660", "Opening hours": "11:00-22:00", "Description": "In 1949, Kihachiro Onitsuka created the first ASICS shoe in his living room in Kobe Japan, under the Onitsuka Tiger name. Onitsuka Tiger, the forerunner of ASICS, was born in 1949. The brand began with Kichachiro Onitsuka's commitment to promote youth health through sport and since then, the Onitsuka Tiger stripes have become synonymous with premium performance in sport. The legend lives on today as a lifestyle brand in the fusion of Japanese heritage and modern flair. With designs ranging from updated classic silhouettes to new styles and collaborations with like-minded artists and cultural connoisseurs, the spirit of Japan resonates in each new collection of Onitsuka Tiger shoes, apparel, and accessories."},
{"Website": "", "Name": "OMEGA", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/d6cbc911ad49b00273c75a1243358aa9.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/omega", "Phone": "25189860", "Opening hours": "10:30-22:00", "Description": "OMEGA offers customers the opportunity to explore the full range of watches, fine jewellery and leather goods."},
{"Website": "", "Name": "New Balance", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/99450d36c16e22de946dea1de7485d3c.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/new-balance", "Phone": "23313683", "Opening hours": "11:00-22:00", "Description": "New Balance is a well-known U.S. sports brand that produce well-structured, high-quality, and professional running shoes and sports apparel. The goal of New Balance is to help runners to achieve their goals. The brand takes pride in being the perfect blend of function and fashion, providing customers the performance they need and the style they want."},
{"Website": "", "Name": "NIKE", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/b863a74482a8625987673de16821720e.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/nike", "Phone": "26917200", "Opening hours": "11:00-22:00 (Sun-Thu)11:00-22:30 (Fri-Sat & PH)", "Description": "Experience sports, training, shopping and everything else that's new at Nike from any country in the world."},
{"Website": "", "Name": "NARS", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/51de32eaad86c25c9de1e54527c45158.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/nars", "Phone": "26615773", "Opening hours": "10:00-22:00 (Mon-Thu) 10:00-22:30 (Fri-Sun)", "Description": "At the heart of NARS is François Nars’ mission to empower women to experiment and have fun with makeup by teaching them how to enhance their natural beauty and individual characteristics. An iconoclastic philosophy, NARS believes there are no rules when it comes to beauty; whatever makes you look and feel good is right.  The power of NARS lies in its elusive, yet tangible appeal: you can hold it in your hand yet find it hard to explain the way you feel when you wear it – glamorous, confident, stylish, forward and infinitely more you."},
{"Website": "", "Name": "natures purest", "Img": "https://ntp.shkp.com/NTP/images/img_shop/fullsize/97daefb52b970e3bbb76cee374d50872.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/natures-purest", "Phone": "24201882", "Opening hours": "11:00-21:30", "Description": "natures purest was founded in the United Kingdom. The brand specializes in natural color cotton which is the most natural and ethically manufactured and grown textile, aims at providing safe and natural products for babies. "},
{"Website": "", "Name": "MOVIE TOWN Ticket Office (Cinema)", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/4900b492e2a67fc91fa4c1931fd14d8b.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/movie-town-ticket-office-cinema", "Phone": "21773896", "Opening hours": "11:00-22:00 (Mon-Fri), 09:00-22:00 (Sun & PH), 09:00-24:00 (Sat & PH eve)", "Description": "MOVIE TOWN is the largest cinema in the New Territories, with more than 1,700 seats in 7 houses. The cinema has introduced the latest revolutionary cinema technologies to the town, including the HK-first Samsung “Onyx Cinema LED” and RealD Cinema, plus the HK-exclusive MX4D motion theatre and House FX. MOVIE TOWN will continue to bring diverse movie programs and international dining options to let every cinephile enjoy the greatest movie moment with their loved ones. What's more? Moviegoers can even enjoy the groundbreaking "},
{"Website": "", "Name": "MOVIE TOWN Cinema (House 1-6)", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/4900b492e2a67fc91fa4c1931fd14d8b.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/movie-town-cinema-house-1-6", "Phone": "21773896", "Opening hours": "11:00-22:00 (Mon-Fri), 09:00-22:00 (Sun & PH), 09:00-24:00 (Sat & PH eve)", "Description": "MOVIE TOWN is the largest cinema in the New Territories, with more than 1,700 seats in 7 houses. The cinema has introduced the latest revolutionary cinema technologies to the town, including the HK-first Samsung “Onyx Cinema LED” and RealD Cinema, plus the HK-exclusive MX4D motion theatre and House FX. MOVIE TOWN will continue to bring diverse movie programs and international dining options to let every cinephile enjoy the greatest movie moment with their loved ones. What's more? Moviegoers can even enjoy the groundbreaking "},
{"Website": "", "Name": "MOVIE TOWN MX4D ® Motion Theatre (Cinema)", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/4900b492e2a67fc91fa4c1931fd14d8b.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/movie-town-mx4d-%C2%AE-motion-theatre-cinema", "Phone": "21773896", "Opening hours": "11:00-22:00 (Mon-Fri), 09:00-22:00 (Sun & PH), 09:00-24:00 (Sat & PH eve)", "Description": "MOVIE TOWN is the largest cinema in the New Territories, with more than 1,700 seats in 7 houses. The cinema has introduced the latest revolutionary cinema technologies to the town, including the HK-first Samsung “Onyx Cinema LED” and RealD Cinema, plus the HK-exclusive MX4D motion theatre and House FX. MOVIE TOWN will continue to bring diverse movie programs and international dining options to let every cinephile enjoy the greatest movie moment with their loved ones. What's more? Moviegoers can even enjoy the groundbreaking "},
{"Website": "", "Name": "Monica Vinader", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/3506a944488d40455f6ea02e371ea692.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/monica-vinader-en", "Phone": "27299392", "Opening hours": "10:00-22:00", "Description": "Since its launch in 2008, Monica Vinader has become a byword for beautifully designed luxury jewellery that bridges the divide between fine and fashion."},
{"Website": "", "Name": "Momonittu", "Img": "https://ntp.shkp.com/NTP/images/img_shop/fullsize/51ee52e3138925badb32e11d23603f3c.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/momonittu", "Phone": "23933688", "Opening hours": "Mon-Thur: 11:00-21:00, Fri-Sun & PH: 11:00- 21:30", "Description": "Established from conceptual combinations of all the good there is in the world, the beauty in everything, and the love for one another, Momonittu is a brand new children’s clothing label that strives to inspire those who wear them."},
{"Website": "", "Name": "Mirabell", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/196d9b62682963fe6e279fcbd98af4a9.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/mirabell", "Phone": "26873768", "Opening hours": "11:00-22:30", "Description": "Build up a wide range of retail network with the multi-brand strategy. Mirabell is now offering good quality of footwear and services to our customers."},
{"Website": "", "Name": "MICHAEL KORS", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/eb7bada6d1e572aef18b463c4de83c3f.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/michael-kors", "Phone": "24111251", "Opening hours": "10:00-22:00", "Description": "MICHAEL KORS is a world-renowned, award-winning designer of luxury accessories and ready to wear. His namesake company, established in 1981, currently produces a range of products through his Michael Kors, KORS Michael Kors and MICHAEL Michael Kors labels, including accessories, footwear, watches, jewelry, men’s and women’s ready to wear, and a full line of fragrance products.  Michael Kors stores are operated, either directly or through licensing partners, in some of the most prestigious cities in the world, including New York, Beverly Hills, Chicago, London, Milan, Paris, Munich, Istanbul, Dubai, Seoul, Tokyo and Hong Kong."},
{"Website": "", "Name": "MARC JACOBS", "Img": "http:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/0a7673355940e71dfcf5341160afea47.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/marc-jacobs", "Phone": "28113107", "Opening hours": "10:00-22:00", "Description": "Marc Jacobs International was founded in 1984 by Marc Jacobs and Robert Duffy. The brand offers women’s and men’s ready-to-wear and accessories, a children’s line called Little Marc Jacobs, as well as multiple award winning fragrances."},
{"Website": "", "Name": "Melissa at MDreams", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f2159b59c5a1957986e5c40690f47cf0.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/melissa-at-mdreams", "Phone": "34682013", "Opening hours": "11:00-22:00", "Description": "Melissa is best known for creating design-driven plastic footwear celebrated by the global fashion community. The renowned Brazilian brand crafts bold, stylish shoes made of plastic complete with a tutti-fruiti scent. The brand has collaborated with top design talent including Jeremy Scott, Jason Wu, Vivienne Westwood, Karl Lagerfeld and more."},
{"Website": "", "Name": "MCM", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/2fa533fce93d25a08d89f400b3e847bd.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/mcm", "Phone": "31881539", "Opening hours": "10:30-22:00", "Description": "Founded in 1976, German brand MCM (Moderne Creation München) crafts luxury leather goods, apparel and footwear for the world’s most seasoned travellers. Through innovation and timeless design, MCM combines iconic German-engineered functionality with traditional craftsmanship, purveying a heritage of elegance. MCM established itself as a global luxury brand through European artisanship with a refined mastery of skills, handcrafting elegant products with flawless quality materials."},
{"Website": "", "Name": "mi-tu moda", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/5307c277a7e87767bf5bf827b0f4844e.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/mi-tu-moda", "Phone": "27579000", "Opening hours": "11:00-22:00", "Description": "moda means ”Fashion” in Italian. Over the past years, mi – tu has dedicated to providing the finest fashion to women who seek for individualism. The brand new mi – tu moda shop has injected different elements from Italian-imported brands such as Anna Rita N and Imperial, turning the original mi – tu into an authentic Italian fashion wardrobe. We aim to help women discover their own style by mix and matching the total look and naturally, the outfits will speak for women’s unique character."},
{"Website": "", "Name": "Marks & Spencer", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/fb882f7ff40847f46e1fd0f872a414a3.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/marks-spencer", "Phone": "28960708", "Opening hours": "10:30-22:30", "Description": "Marks & Spencer is one of the UK’s lending retailers. Marks & Spencer sells high quality, great value clothing and home products as well as outstanding quality food."},
{"Website": "", "Name": "MAX&Co.", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/0e5d190c8cece62ec68722e31de58d32.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/maxco", "Phone": "27229612", "Opening hours": "11:00-22:00 (Mon-Fri)\n10:00-22:00 (Sat-Sun & PH)", "Description": "MAX&Co. conceives dynamic, varied and savvy collections on materials, workmanship and details. Creativity and quality are constant values for its smart, fresh, affordably luxurious collections. With free, extensive creativity and design for clothes and accessories, its creation can be mix-and-matched in a personal, individual and dynamic way."},
{"Website": "", "Name": "MARK NASON LOS ANGELES", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/46f7d27704856c36118bcf36cfd2ff51.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/mark-nason-los-angeles-en", "Phone": "26028983", "Opening hours": "10:00-22:30 (Mon-Thu) 10:00-23:00 (Fri-Sun)", "Description": "Mark Nason ® Collection was launched in 2000 by its namesake, brand founder Mark Nason. The Collection originated in Italy with an exotic offering of shoes, boots and accessories in spired by iconic rock and roll of the seventies. In recent years, popular demand for the high-end footwear has evolved into Mark Nason ® Los Angeles with an expanded assortment of dress, casual and active styles for men and women. With decades of footwear experience behind him, Nason continues to drive and inspire the brand with his passion for premium design and beautifully crafted details. "},
{"Website": "", "Name": "Marathon Sports", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/fd672973385c7371686b89a8a6e4f4ed.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/marathon-sports", "Phone": "26991289", "Opening hours": "11:00-22:00", "Description": "Marathon Sports is the largest and the most popular sports store in Hong Kong. It provides a wide selection from mainstream sports to active lifestyle selection of footwear, apparel and accessories. With an extension network in both prime and fringe locations, it offers the ulmost convenience for your health and sporting needs."},
{"Website": "", "Name": "Mannings", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/46c4ccec7b86e85eefb8ec366568de32.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/mannings", "Phone": "26034318", "Opening hours": "09:00-22:30", "Description": "Mannings is Hong Kong’s leading health and beauty chain. With 100% genuine product guarantee, Mannings provides high quality and comprehensive range of products that are tailored to customers’ needs."},
{"Website": "", "Name": "Maison Christian Dior", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/1e76bb793cb47b942bf8a9f234f2678d.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/maison-christian-dior", "Phone": "31880207", "Opening hours": "10:00-22:00", "Description": "The new fragrance concept boutique, Maison Christian Dior is a place in which everything has been designed to make you feel good, in an atmosphere conducive to fully experience the pleasure of perfume. Like the soulful interior of a Haussmann apartment scented with style, all that matters is the pure pleasure of perfume. Maison Christian Dior embodies a refined yet casual approach and becomes a fully-fledged lifestyle, colouring every moment of your life."},
{"Website": "", "Name": "Maje", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/a45a607856d7ffb7601c0c30a74466c3.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/maje", "Phone": "22690218", "Opening hours": "10:30-22:00", "Description": "Fascinated by fabrics from an early age, designer Judith Milgrom founded Maje in 1998, named the label using the initials of her closest loved ones. Based in Paris, Maje appeals to the ultra-stylish and effortlessly chic, whisking together delicate bohemia with strong confidence and purpose. Maje blends the original with the contemporary, giving feminine silhouettes sharp detailing and mixing everyday versatility with covetable glamour."},
{"Website": "", "Name": "mademoiselle", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/5d624bac66f7811d87de1bfe026c9318.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/mademoiselle", "Phone": "26061797", "Opening hours": "11:00-22:00", "Description": "mademoiselle emphasizes on the importance of mix & matching, different styles could be easily invented to accommodate various occasions with unexpected surprises!"},
{"Website": "", "Name": "LUSH", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/8aef1aa1ded28311db01d5087d62bc61.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/lush", "Phone": "26021266", "Opening hours": "10:00-22:00", "Description": "Since establishing in 1995 in UK, Lush currently has over 900 shops in 51 countries. Lush produces a wide range of safe and innovative beauty products with fresh ingredients like organic fruits and vegetables, and some of the products have been patented. Lush operates a strict policy against animal testing and supports Fair Trade and Community Trade initiatives. Lush leads the cosmetics industry in combating over-packaging by running public awareness campaigns and developing products that can be sold ‘naked’ to the consumer without any packaging. Lush has been awarded the RSPCA Good Business Award for 2006 and 2007 and the International Fund for Animal Welfare ‘Business of the Year’ award for 2010."},
{"Website": "", "Name": "Ma Belle", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f0ebde350d59d51b7aa447a6d15fe1fb.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/ma-belle", "Phone": "26972525", "Opening hours": "11:30-21:30", "Description": "By combining the top quality diamonds and rigorous craftsmanship, each gorgeous piece at MaBelle represents excellence and value. MaBelle provides customers with an easy and smooth shopping experience, with fixed prices, a vast selection and professional service."},
{"Website": "", "Name": "lululemon", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/b20e3dae00261dafe1d7d38bfa4fc970.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/lululemon", "Phone": "22346433", "Opening hours": "10:00-22:00", "Description": "lululemon makes technical apparel for yoga, running, dancing and most often sweaty pursuits. Our store is a community hub for our guests in the New Territories."},
{"Website": "", "Name": "LUKFOOK JEWELLERY", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/d8a575ba85a9d5a34f50cb97c014c230.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/lukfook-jewellery", "Phone": "26062366", "Opening hours": "10:00-22:00", "Description": "Upholding the motto of “Exquisite Craftsmanship, Quality Services and Customer-Oriented”, Lukfook Jewellery is dedicated to fulfilling customers’ needs by offering top quality products and outstanding services in a pleasant shopping environment."},
{"Website": "", "Name": "LOG-ON", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/dedc0e647f5fbc24637eff3e259a8392.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/log-on", "Phone": "2736 3866", "Opening hours": "10:30-22:00 (Sun-Thur) 10:30-22:30 (Fri-Sat)", "Description": null},
{"Website": "", "Name": "Links of London", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/e4c40360db513a284beccaa2ad8cf17f.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/links-of-london", "Phone": "24889020", "Opening hours": "11:00-22:00", "Description": "Links of London was founded in 1990 and now has over 60 stores around the world. As one of the coveted jewellery brands, Links of London captivate customers with jewellery collections, watches and exquisite gifts. The design, craftsmanship and finest materials have remained integral to each collection."},
{"Website": "", "Name": "le saunda", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/19a87dbb4ef3697b1ef24149ccb6666a.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/le-saunda-en", "Phone": "26050008", "Opening hours": "10:30-22:00", "Description": "le Saunda established since 1979 in Hong Kong. The network is now covering Mainland China , Hong Kong and Macau. le Saunda specialized in manufacturing many different types of trendy products and quality accessories which suitable for high standard of living people. Apart from ladies shoes, there are also men shoes, bags and other accessories. \"Legend of Uniqueness\" seems to be a landmark of le Saunda in these 30 years.\""},
{"Website": "", "Name": "LONGCHAMP", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/fdf00fb4a8782c22c9a4bd5235a77d0f.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/longchamp", "Phone": "26233885", "Opening hours": "11:00-22:00", "Description": "Longchamp was founded in Paris in 1948. Diversified into luggage, handbags and accessories, Longchamp has asserted its fashion credentials with the creation of internationally desirable It-bags and the launch of complete shoes and ready-to-wear collections. Combining craftsmanship and innovation, Longchamp owns more than 230 exclusive boutiques worldwide and is available in more than 2,000 multi-brand stores in over 100 countries."},
{"Website": "", "Name": "Lenovo", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/7d8a3a825399185c997a531db1c56e07.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/lenovo", "Phone": "34223302", "Opening hours": "11:00-22:00", "Description": "Lenovo is a global leader in innovating consumer, commercial and enterprise technologies. Their portfolio of high-quality, secure products and services covers PCs (including the legendary Think and multimode YOGA brands), workstations, servers, storage, smart TVs and a family of mobile products like smartphones (including the Motorola brand), tablets and apps."},
{"Website": "", "Name": "Levi's Store", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/6644068e33f7dc8c2f2dd5912d06f1b1.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/levis-store", "Phone": "26977016", "Opening hours": "11:00-22:00", "Description": "The Levi’s® brand epitomizes classic American style and effortless cool. Since their invention by Levi Strauss & Co. in 1873, Levi’s® jeans have become the most recognizable and imitated clothing in the world – capturing the imagination and loyalty of people for generations. Today, the Levi’s® brand portfolio continues to evolve through a relentless pioneering and innovative spirit that is unparalleled in the apparel industry. Our range of leading jeans-wear and accessories are available in more than 110 countries, allowing individuals around the world to express their personal style."},
{"Website": "", "Name": "la prairie", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/7535af616164377e5226d68d7169d6b4.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/la-prairie", "Phone": "24877011", "Opening hours": "10:00-22:00", "Description": "la prairie, Switzerland is renowned both for the scientific integrity of its products has made its treatments the most sought-after in the world by those for whom only the best is good enough."},
{"Website": "", "Name": "L'Oreal Paris", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/18f8443c72ccf815ef0d93a9001a37ee.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/loreal-paris", "Phone": "25061883", "Opening hours": "11:00-22:00", "Description": "L'Oreal Paris Boutique brings a unique sophiticated environment to the discerning shopper. Shoppers can choose from a wide range of products including Skincare, Make-up, Body Care and Hair Care, with a sophisticated \"Skin Analysis System\" and professional advice from Beauty Advisors. Customers can be sure to to find the perfect skincare solutions to suit individual needs."},
{"Website": "", "Name": "Lancôme", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/b814a6af8406ecc81040c0abeeeae81d.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/lanc%C3%B4me", "Phone": "26987822", "Opening hours": "10:00-22:00 (Mon-Thu)\n10:00-22:30 (Fri-Sun & PH)", "Description": "Since 1935, Lancôme has always been at the heart of women. Perfume, skincare and make-up which complement each other, innovation and research for the highest quality have all made Lancôme the leading luxury brand, the ultimate image of French femininity in 130 countries. In over 78 years, Lancôme has acquired a unique expertise of skin. In skincare, Lancôme stays continuously ahead of its time and invent the science of tomorrow. Lancôme also capitalizes on its mythical make-up expertise, continuing to innovate with exclusively designed applicators, effective and unique textures, offering women all over the world a carefree way to achieve the beauty of Effortless Chic. Concerning fragrances, Lancôme was able to affirm its position in the world of fragrance with La vie est. belle that celebrates the most beautiful moments of women’s lives."},
{"Website": "", "Name": "La Mer", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/e71ba13aa3a447be07fca0ef1b169ac7.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/la-mer", "Phone": "21105855", "Opening hours": "10:00-22:00", "Description": "The mere mention of Crème de La Mer inspires intrigue, adoration and a cult-like devotion."},
{"Website": "", "Name": "LE CREUSET", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/0a53120c5dadd6fa2090899e3aef7ba9.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/le-creuset", "Phone": "26400082", "Opening hours": "10:30-22:00", "Description": "Since introducing the signature round cocotte in 1925, Le Creuset has continued to be one of the most distinguished brands in cookware.  Well-known for their enamelled cast iron cookware, Le Creuset is consistently chosen by leading chefs, restauranteurs, and lovers of cooking to appreciate the performance, cooking advantages, and style of their products. Le Creuset is the world’s leading manufacturer of enamelled cast iron cookware and maintains the high status by making sure each product is only made with exceptional quality, superior materials, and innovative design.  Le Creuset’s Screwpull wine accessories return fun and sophistication to the uncorking of your celebrations while the stoneware brings any meal to the table in a gorgeous presentation."},
{"Website": "", "Name": "L'OCCITANE", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/ba4507aee53038f30483f5c03a036bcb.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/loccitane", "Phone": "26963788", "Opening hours": "11:00-22:00", "Description": "Originated from France, L'OCCITANE is determined to offer premium quality products that reflect a true French lifestyle. Product ranges include skin and body care, fragrance products for men, women and the home. All the product ranges are manufactured with premium quality natural ingredients primarily from Provence. The product packaging respect traditions and is environmentally friendly. All are produced according to strict ethical guidelines."},
{"Website": "", "Name": "Kiehl's Since 1851", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/71a3b3a57054af59e7d510445658a0f6.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/kiehls-since-1851", "Phone": "34273884", "Opening hours": "10:00-22:00 (Mon-Thu,Sun & PH)\n10:00-22:30 (Fri-Sat)", "Description": "Kiehl's Since 1851, the venerable New York-based purveyor of fine quality skin and hair care. From Kiehl's early years as a full-service pharmacy, Kiehl's chemists have developed formulas to help alleviate varying skin conditions utilizing natural ingredients sourced the world over with advances in science.Its unique and extensive background represents a blend of cosmetic, pharmaceutical, herbal and medicinal knowledge developed and passed on through generations. Serving the community is always the mission of Kiehl's. Over the years, Kiehl's has been active in charity projects."},
{"Website": "", "Name": "JINS", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/49fff66ce52ebe12218507580d30a8f0.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/jins-en", "Phone": "23681921", "Opening hours": "10:00-22:00", "Description": "JINS is an eyewear brand founded in Japan in year 2001, it has more than 300 stores in Japan. It provides the crafting stylish, Japan quality and innovative eyewear at affordable price, aims to offer a convenient, comfortable and enjoyable shopping experience for customers."},
{"Website": "", "Name": "K-SWISS", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/93d85cec402ccec2014a960e01dc21f8.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/k-swiss-en", "Phone": "35848048", "Opening hours": "10:30-22:00", "Description": null},
{"Website": "", "Name": "KENZO", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/818c5b88f174688771fbba1124beba28.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/kenzo", "Phone": "21551168", "Opening hours": "10:00-22:00", "Description": "In 1970, Kenzo Takada installed a patch of jungle in the Galerie Vivienne in the heart of Paris. With its colorful prints and declaration of freedom, Kenzo shook up the couture codes of the time by irreverently breaking the rules. Keeping this joyous and colorful heritage alive, Humberto Leon and Carol Lim took over the artistic direction of the House in 2011. This extraordinary creative duo rediscovered the pioneering and offbeat spirit that lies behind KENZO’s success."},
{"Website": "", "Name": "JOYCE Beauty", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/d22e1e28977edf16b659bf082d1e26b1.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/joyce-beauty", "Phone": "34223910", "Opening hours": "10:00-22:00", "Description": "Renowned as the ultimate luxury beauty destination in Hong Kong. JOYCE Beauty is home to the world's most coveted beauty brands and the most sophisticated new products, ranging from skincare, hair care, body care, makeup, fragrance to cult at-home beauty devices. The elegant and exclusive emporium curates niche brands that are innovative, intelligent and results-oriented. It is this strict adherence to efficacy and elegant that ensures the city's most global and sophisticated clientele return time after time."},
{"Website": "", "Name": "kate spade new york", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f3d303634113fb75c681106deaabb38f.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/kate-spade-new-york", "Phone": "31884220", "Opening hours": "11:00-22:00", "Description": "Fun, playful, delicate, and functional are the signature of Kate Spade New York. Their graceful, exuberant approach to the everyday is evident in every category they enter, from handbags and clothing to jewellery, shoes, stationery and glasses."},
{"Website": "", "Name": "Juicy Couture", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/3c2e71b1efe6f0443df00679067df373.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/juicy-couture", "Phone": "26092898", "Opening hours": "11:00-22:00", "Description": "Juicy Couture is a glamorous, irreverent, and fun lifestyle brand for the decidedly fashionable. Embracing the effortless attitude of its Los Angeles heritage, Juicy discovers the couture in the every day, and delivers an element of surprise in all of its designs. The global phenomenon is identified as a casual luxury brand, offering apparel in the categories of women, girls and baby, handbags, shoes, intimates, swimwear, fragrance, accessories and jewelry."},
{"Website": "", "Name": "Joy & Peace", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/73b23962fdc3e6b07f9b4e0b9bb9b008.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/joy-peace", "Phone": "26790277", "Opening hours": "11:00-22:00 (Mon-Thu)\n10:30-22:00 (Fri-Sun & PH)", "Description": "JOY & PEACE produces an exclusive range of ladies' footwear, influenced by European style, with designers from Italy, France, and Spain. At competitive prices, their designs are perfect for young professionals and executives."},
{"Website": "", "Name": "Jo Malone London", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/3cfec1fb22b4b1fa75b566db50bb19d9.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/jo-malone-london", "Phone": "21132728", "Opening hours": "10:00-22:00", "Description": "Fill your life with scent. British bespoke fragrances. For her. For him. For the home. Immaculately wrapped in our signature box. Create an individual statement. An understated style. Defined by an unconventional sense of sophistication. With taste that is rarified, yet a touch audacious. Timeless and elegant…but always infused with a charming dash of wit and whimsy. It is exactly these distinctly British qualities that are the heritage, and heart. Jo Malone London has become a name internationally synonymous with all that is most coveted in British style."},
{"Website": "", "Name": "Jessica", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f5865456c848519558f882d8a8f84287.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/jessica-en", "Phone": "26964122", "Opening hours": "11:00-22:00", "Description": "Jessica is a stylish and contemporary fashion label with a perceptible display of feminine flare. True to what the brand stands for, Jessica’s creations are both alluring and modern, using only superior quality yarns and fabrics and exquisite workmanship. Fundamental to Jessica’s designs are the artistic decorative details, the novelty fabrics, the beautifully crafted embellishments, trendy silhouettes and the forever-new production techniques and applications."},
{"Website": "", "Name": "H&M", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/fe8429027ff987b2df8e3a48a0eeac21.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/hm", "Phone": "26067708", "Opening hours": "10:30-22:30", "Description": "H & M Hennes & Mauritz AB (publ) was founder in Sweden in 1947 and is quoted on NASDAQ OMX Stockholm. The company’s business concept is to offer fashion and quality at the best price. In addition to H&M, the group includes the brands COS, Monki, Weekday, Cheap Monday as well as H&M Home. The H&M Group has more than 2,200 stores in 40 markets, including franchise markets. In 2010 sales including VAT were SEK 126,966 million and the number of employees was around 87,000."},
{"Website": "", "Name": "intimissimi", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/6672c29d88d40a3bbd3a3966418ee114.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/intimissimi", "Phone": "35808138", "Opening hours": "10:00-22:00", "Description": "Intimissimi, the Italian lingerie brand of underwear for women and men, expresses a simple but refined style. The combination of high-quality products, romance and imagination has won loyal customers all over the world and established the brand leading position on the market. The brand continuously reinvents its design, with excellent cut and materials. Other than underwear, the brand also produces clothing and nightwear collections. The competitive quality/price ratio is a contributing factor to the brand's success."},
{"Website": "", "Name": "Jack Wills", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/14569be8c4d21e16fafee516a703b5b1.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/jack-wills", "Phone": "35802858", "Opening hours": "11:00-22:00", "Description": "Jack Wills designs British heritage-inspired goods for the university crowd. They continue to be influenced by the best of British, from their history and culture to sporting and country pursuits. They take pride in using the finest quality materials, techniques and design to deliver the distinctive connection between the old and new, epitomising what it is to be young and Fabulously British."},
{"Website": "", "Name": "izzue", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/b424488398088a94655107f6fa2af6a7.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/izzue", "Phone": "26983217", "Opening hours": "11:00-22:00 (Sun-Thu & PH)11:00-23:00 (Fri&Sat)", "Description": "Started in the winter of 1999, izzue has become the I.T group's most popular label among the local young fashion lovers. Its design highlights \"casual chic\", perfect for those who wish to create personal style through mix and matching. izzue catches the latest trend adapting the \"must-have\" elements from each season, bringing a breath of fresh air to the mainstream fashion."},
{"Website": "", "Name": "initial", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/1982b638d46f373c4b42a5a05a57b605.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/initial", "Phone": "26021055", "Opening hours": "11:00-22:00", "Description": "Initial fashion brand founded in 2000, all along, each of the design team used to keep forward-looking vision and perspective. Initial has been unwaveringly dedicated to exploring unique & cutting-edge designs, to enrich the intellectual life to our customers. From several fashion collections to the store, bringing again and again \" unusual experience\" to our customers."},
{"Website": "", "Name": "IPSA", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/bcc0c97f504ed626684e14d126890f20.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/ipsa", "Phone": "26996886", "Opening hours": "10:30-22:00 (Mon-Thu,Sun & PH) 10:30-22:30 (Fri-Sat)", "Description": "IPSA has committed to \"Inspire the unique beauty\" in its customers. By understanding the customers' lifestyle, and with the data analysis from IPSALYZER, the brand creates a personal solution to help its customers become their beautiful selves."},
{"Website": "", "Name": "Haglöfs", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/b735f62b54d7baa20101ff0625afecec.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/hagl%C3%B6fs", "Phone": "26173611", "Opening hours": "11:00-22:00 (Mon-Sun & PH)", "Description": "Originated from Sweden, Haglöfs was established in 1914. It is not only the world's leading outdoor brand, but one of the most important manufacturer using global high-tech Gore-Tex® fabric for jackets. Haglöfs specializes in quality clothing, backpacks and footwear. Developed by Swedish designer, its clothing set in a high-end functionality and fashion which create urban and outdoor lifestyle."},
{"Website": "", "Name": "i.t", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/0bb99dde48946aabf6c537deba00662e.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/it", "Phone": "26970510", "Opening hours": "11:30-22:30", "Description": "i.t shops hold the most popular casual labels as well as introducing the ever-growing popular Japanese brands such as Beams Boy, Beams T, Earth Music & Ecology, Pou Dou Dou, Vert Dense, X-Girl, etc. i.t shops provide a whole variety of easy-wearing and trendy clothes."},
{"Website": "", "Name": "Guerlain", "Img": "http:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/3c72bcd8839fa5cc0e42fa9c0091b654.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/guerlain", "Phone": "31010459", "Opening hours": "10:00-22:00", "Description": "Guerlain Parfumeur, Paris, since 1828. A heritage of creative audacity and savoir-faire."},
{"Website": "", "Name": "Giorgio Armani Beauty", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/515cf303a097dbc1f796044fe2cb3918.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/giorgio-armani-beauty-en", "Phone": "26055100", "Opening hours": "10:00-22:00", "Description": "To make a perfect match with his premium fashion, Giorgio Armani, the “Master of Beauty”, founded his own luxurious cosmetic brand with supreme and highly-professional products in makeup, skincare and fragrance render the brand a unique position in the beauty market."},
{"Website": "", "Name": "Global Timepieces", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/c554410600f83516fe62fed9e65fac3c.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/global-timepieces-0", "Phone": "22973982", "Opening hours": "10:30-22:00", "Description": "We are currently operating seven retail shops in Hong Kong. Global Timepieces Limited is the authorized dealer for more than thirty top luxury brands, including Breitling, Rado, Longines etc. Our sales team is well trained with professional training, and provide professional advice and high quality service to our customers, in order to help them to select the most suitable watches. Welcome to visit our shop to experience the Art of Luxury."},
{"Website": "", "Name": "GAP", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/2a890737710e9c35455f9dcbe9bc6bbf.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/gap", "Phone": "26090119", "Opening hours": "10:00-22:30 (Mon-Fri)\n10:00-23:00 (Sat-Sun & PH)", "Description": "Founded in 1969 in San Francisco, today Gap Inc. is a leading global retailer offering clothing, accessories, and personal care products for men, women, children, and babies."},
{"Website": "", "Name": "giordano ladies", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/7370093024c561203f8571c23c55b3b8.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/giordano-ladies", "Phone": "29294350", "Opening hours": "11:00-22:00", "Description": "Giordano Ladies believes “good things shouldn’t cost anything extra.” From shop interior design, product style and intimate customer service, we aim to deliver our customers the beauty and values in Simplicity, Modern Classic, Timelessness and Personality."},
{"Website": "", "Name": "FURLA", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/b813a6799bc03059721e4efa16498239.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/furla", "Phone": "26901982", "Opening hours": "11:00-22:00", "Description": "FURLA today. A genuine Italian company based in Bologna, a leader on the international stage.FURLA, created by the Furlanetto family in 1927, is one of the major players in the worldwide leather goods market. The brand’s DNA is expressed through the values of Italian craftsmanship, distinctive creativity, quality and timeless elegance. Simplicity and uniqueness, femininity and modernity are blended in a highly original balance."},
{"Website": "", "Name": "GEOX", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/ecc1ebce1e384a4e6b9595f284d5789c.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/geox", "Phone": "26028229", "Opening hours": "10:00-22:00", "Description": "The Geox brand name comes from the Greek word geo (i.e. Earth), on which we all walk, and the letter x, which stands for the technology element. The origin of the Geox name speaks of the deep-rooted calling of a company born out of a revolutionary idea which has made comfort, well-being and health its corporate bastions."},
{"Website": "", "Name": "Fotomax", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/0f17884e8bea2a41e1a8f596988b08d8.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/fotomax", "Phone": "26988609", "Opening hours": "10:00-21:30", "Description": "All Fotomax shops use Fujifilm Digital Laser Printing technology to provide high quality photofinishing and digital photo output services. Fotomax also provides a full range of Digital Imaging Services, Professional Imaging Services, Document Solution Services as well as the sales of other imaging related products."},
{"Website": "", "Name": "FOCO Headphone pro-shop", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/3e3f635341780f8511a37c2ead88ea3b.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/foco-headphone-pro-shop", "Phone": "21114099", "Opening hours": "11:00-21:30", "Description": "FOCO Lifestyle & Headphone Pro-Shop displays more than 100 headphones and audio equipments such as DAC, headphone amplifier, music player, etc. Here, customers can browse the items to find what suits them best, as well as connect with other music lovers."},
{"Website": "", "Name": "Fortress World", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/1fdf35f5323c147c9bb232b3e52bd3ca.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/fortress-world", "Phone": "26947866", "Opening hours": "10:30-22:00 (Mon-Fri)\n10:30-22:30 (Sat-Sun&PH)", "Description": "FORTRESS wells electrical products at great value, offering the leading brands, the latest model and the lowest price guaranteed to a diverse customer base who shop for everything from personal electronics, digitial devices to home appliances. The prices & offers at FORTRESS are also the most attractive ones in town, including those exclusive premiums & models of famous brands."},
{"Website": "", "Name": "G2000 / G2000 Black", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/85c107460a9a53e5a792ea2dfba65bb2.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/g2000-g2000-black", "Phone": "26795516", "Opening hours": "10:30-22:30 (Mon-Thu)\n10:00-23:00 (Fri-Sun & PH)", "Description": "With sophisticated blended fabrics and perfect cutting, G2000 offers highly versatile coordinating pieces and in-trend styles that fulfill modern men’s and women’s need for presentable and confident city living across their career wardrobe and relaxed occasions."},
{"Website": "", "Name": "Fresh", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/65ee50060d0b1494c00dc797acb61be6.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/fresh", "Phone": "23360688", "Opening hours": "10:00-22:00", "Description": "Fresh has been truly a pioneer in utilizing natural ingredients, combining traditional beauty remedies with advanced technology to bring a variety of products that encompass utmost luxury and style. The boutique interior is streamlined, clean, and white, echoeing the spirit and style of Fresh."},
{"Website": "", "Name": "FILA", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/2ca904236e6cac3f91475e7c140db0a1.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/fila", "Phone": "23212923", "Opening hours": "11:00-22:00", "Description": "Fila began in 1911, in the small alpine town of Biella, Italy, a place renowned for manufacturing the world's finest textiles, and weaving fabrics with impeccable quality, true innovation and extraordinary beauty. Born of this city and its traditions, Fila is inexorably derived from Biella's dedication to artistry, luxury and elegance. This is our birthright, it's in our soul, and it ultimately defines us."},
{"Website": "", "Name": "FILA KIDS", "Img": "https://ntp.shkp.com/NTP/images/img_shop/fullsize/956d757c2d124a4ed2e4f0dcd1b9936e.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/fila-kids", "Phone": "24120368", "Opening hours": "12:00 - 21:00", "Description": "FILA KIDS is one of the sub brand of FILA which aims at creating a children's clothing brand that combines the latest styles with comfort features that dress girls and boys, perfectly for any sports occasion."},
{"Website": "", "Name": "Eu Yan Sang", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/6aab71f09ea1aad2d282ce1536d52a8a.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/eu-yan-sang", "Phone": "25721119", "Opening hours": "11:00-22:00", "Description": "Founded in 1879, Eu Yan Sang has become one of the most important and respected retailers of traditional Chinese herbs and medicines in Southeast Asia. Driven by the spirit of caring for mankind and adhering to quality standard, the Company produces the best natural Chinese medicinal products in accordance with ancient formulae and under the strictest quality-control procedures. The most famous products include “Bo Ying Compound” for infants and “Bak Foong Pills” for women."},
{"Website": "", "Name": "Ferrari Junior", "Img": "https://ntp.shkp.com/NTP/images/img_shop/fullsize/bf15535221bc12f94b5f803ffd0d1b30.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/ferrari-junior", "Phone": "31049105", "Opening hours": "11:00 - 21:00", "Description": "Ferrari Junior Collection incorporates Ferrari's signature colours and meticulous craftsmanship with a perfect mix of classic and daring elements, to present the Ferrari passion and ravishing energy. The brand provides infants and children aged up to 14 years old with a wide range of exquisite and stylish children’s wear, for daily styling and special occasions. "},
{"Website": "", "Name": "ESTÉE LAUDER", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/265edf0cbd8491b81d821260f36c8aff.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/est%C3%A9e-lauder", "Phone": "26920882", "Opening hours": "10:00-22:00", "Description": "In 1946 Estēe Lauder founded her company with an unshakeable belief: every woman can be beautiful. Today, the Estēe Lauder skincare, makeup and fragrance exemplify the best that art and science can achieve. The Estēe Lauder name on a product is recognized in over 120 countries and territories, for quality maintained and promises kept."},
{"Website": "", "Name": "EVISU", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f08fd45ff59bc74a3d5abd31ab09edc2.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/evisu", "Phone": "21748678", "Opening hours": "11:00-22:00", "Description": "EVISU was founded in Osaka Japan in 1991 and is named after the Japanese god of prosperity Ebisu."},
{"Website": "", "Name": "FIVE CM", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/3366194f863e50607f1a2da451a27883.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/five-cm-en", "Phone": "26976015", "Opening hours": "11:00-22:00 (Sun-Thu & PH)11:00-23:00 (Fri&Sat)", "Description": "FIVE CM is a house label of the I.T group featuring unisex clothing. Guys and gals love the casual simplicity of the line, which takes denim and cotton-drill as its foundations."},
{"Website": "", "Name": "ECCO", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/1b81df61edc262a8db3acfaf31de839f.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/ecco", "Phone": "26970369", "Opening hours": "10:00-22:00", "Description": "ECCO is an international shoe brand with Danish roots and is one of the few companies to have achieved full vertical integration – upstream and downstream – thereby controlling the process from production of leather raw materials."},
{"Website": "", "Name": "eGG Optical Boutique", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/116947caa47f492e8e5531a4b7ac245f.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/egg-optical-boutique-en", "Phone": "23990036", "Opening hours": "11:00-22:00", "Description": "eGG, a popular local eyewear brand among youngsters, dedicated to integrating creativity into product designs. The brand new eGG concept store collaborates with SMILEY® - a renowned brand in France, to offer not only various collections of eGG eyewear, but also exclusive accessories and snacks of SMILEY®! With the exhibit of several SMILEY® figurines at store, we wish to provide a unique and joyful shopping experience to our customers."},
{"Website": "", "Name": "Dior Beauty", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/79c905405fb145db8718fbb1c43bcd35.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/dior-beauty-en", "Phone": "26986711", "Opening hours": "10:00-22:00", "Description": "Dior Beauty Concept Boutique is a work of ingenuity by fashion designer John Galliano and Tyen, the creative director of Dior. Their combined genius and originality have resulted in the birth of an exceptional concept store that embarks the theme of cutting-edge fashion stage, Backstage Make-Up and personalized beauty experience, which elevates Dior's total beauty experience to a new height."},
{"Website": "", "Name": "double-park", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f8d333728d16ab8b4cac19339b26163e.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/double-park-en", "Phone": "26986152", "Opening hours": "11:00-22:00 (Sun-Thu & PH)11:00-23:00 (Fri-Sat)", "Description": "Fingercroxx, a house label available at double-park, has been the driving force behind urban sports culture in Hong Kong. Fingercroxx incorporates details and features of innovative functionality and fashion from around the globe to produce clothing."},
{"Website": "", "Name": "DANIEL WELLINGTON", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/f9d35ccc819a2f81827dc293dec8c99c.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/daniel-wellington-en", "Phone": "27287299", "Opening hours": "10:00-22:00", "Description": "Daniel Wellington is a Swedish brand founded in 2011. Known for its sleek and minimalist design, DW offers timeless accessories, worn on all occasions by men and women all over the world. Since its inception, Daniel Wellington has sold over 6 million watches, and established itself as one of the fastest growing and most beloved brands in the watch industry.  Its social media community has quickly evolved into a global movement, that every day, photo by photo, helps growing, defining and developing the Daniel Wellington brand. "},
{"Website": "", "Name": "DG Lifestyle Store", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/1945da7fac051b297024d409e551cd65.JPG", "Url": "http://www.newtownplaza.com.hk/shop/en/dg-lifestyle-store", "Phone": "26922488", "Opening hours": "10:00-22:00 (Mon-Sun&PH)", "Description": "DG Lifestyle store carry the leading pioneer digital lifestyle products from all over the world and have been successfully serving the Macintosh market since 1994 in Hong Kong & China. We are the first appointed Apple Center in Asia Pacific and we have won various Asian Pacific Best Apple Center award in 2000, 2001, 2002, 2004 and 2005."},
{"Website": "", "Name": "Club Monaco", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/8a2b9c8ed04dd1dc90889593ec95cd51.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/club-monaco", "Phone": "26020988", "Opening hours": "11:00-22:00", "Description": "Club Monaco is a women’s and men’s fashion brand built on thoughtful, versatile design that celebrates the individual. Born in Canada and raised in New York, Club Monaco is home to190 stores across the U.S., Canada, the UK and Asia with an online presence at clubmonacohk.com."},
{"Website": "", "Name": "Clé de Peau BEAUTÉ", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/64805f5340930d21a22eef34bec66a16.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/cl%C3%A9-de-peau-beaut%C3%A9", "Phone": "26119889", "Opening hours": "10:00-22:00 (Mon-Thu, Sun & PH) 10:00-22:30 (Fri-Sat)", "Description": "Launched in 1982, Clé de Peau Beauté combines Japan’s cutting-edge science and aesthetic sense with modern French elegance."},
{"Website": "", "Name": "Coach", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/a94bea562893c3ead0108ce8553ff6bf.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/coach", "Phone": "26060599", "Opening hours": "10:15-22:00 (Mon-Fri) 10:15-22:00 (Sat, Sun & PH)", "Description": "Coach is a leading fashion accessories brand offering the finest luxury handbags, accessories and gifts."},
{"Website": "", "Name": "CMK Electrical Store", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f07cb2ab3268d7aea135e0dd543911e2.JPG", "Url": "http://www.newtownplaza.com.hk/shop/en/cmk-electrical-store", "Phone": "26812938", "Opening hours": "10:30-21:30 (Sun-Fri)\n10:30-22:00 (Sat & Before PH )", "Description": "CMK offers a comprehensive range of the world's leading brands of audio-visual products, home appliances, mobile phone and photographic goods. All electronic products are import from local dealership."},
{"Website": "", "Name": "Columbia Sportswear Company", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f590c3d0cf0afb56e36f9de6334d92ab.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/columbia-sportswear-company", "Phone": "26984181", "Opening hours": "11:00-22:00", "Description": "Columbia Sportswear, being the pioneer in outdoor sportswear technology, has revolutionized the active outdoor and adventure travel trend. It has developed trademark outdoor sportswear technology, which includes Omni-Tech®(waterproof, windproof & breathable)jackets, Omni-Dry® quick dry material and Omi-Grip® footwear technology."},
{"Website": "", "Name": "CLINIQUE", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/1d88f05fa65659b41cb2a6630c51793e.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/clinique", "Phone": "26987077", "Opening hours": "10:00-22:00", "Description": "Introduced in 1968, CLINIQUE was the first ever dermatologist-created, prestige cosmetic brand. CLINIQUE’s mission has always been to provide the highest quality and customized products to enhance every skin type and tone for all ages, races and genders. All makeup and skin care products are meticulously tested and carefully formulated with the latest science. Allergy Tested and 100% Fragrance Free."},
{"Website": "", "Name": "city'super", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/222f7c8045c76bcddd595416c490d84f.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/citysuper", "Phone": "27363866", "Opening hours": "10:00-22:00 (Mon-Thu,Sun & PH)\n10:00-23:00 (Fri-Sat)", "Description": "City'Super is a \"Mega Lifestyle Specialty Store\" that offers true one-stop-shopping to today's busy urban professionals. It is designed to be a part of the customers' lifestyle by not just satisfying their daily needs but also enhancing the quality of life."},
{"Website": "", "Name": "Chow Sang Sang", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/8433e5b968f16a0cbf74e1157c84ef21.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/chow-sang-sang", "Phone": "26073198", "Opening hours": "10:30-22:00", "Description": "With a rich heritage spanning over 70 years. Chow Sang Sang is the leading jewellery manufacturer and retailer in the trade operating over 190 shops throughout the Greater China region. Apart from self-innovated products. Chow Sang Sang sources world-class jewellery bands in order to provide a wider choice of quality jewellery for its customers. Its professional and complete jewellery services always ensure customers a satisfactory shopping experience."},
{"Website": "", "Name": "Clarks England", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/9ab14f3ef6aaed750da4a1ef2e766d8a.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/clarks-england", "Phone": "26091133", "Opening hours": "11:00-22:00", "Description": "Clarks is an international renowned footwear brand with over 188-year history from the United Kingdom. Clarks offers a wide range of fashionable and functional footwear for men, women and children."},
{"Website": "", "Name": "CLARINS", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f13dcad708f62f4990fc1869651a4b19.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/clarins", "Phone": "26793367", "Opening hours": "10:00-22:00", "Description": "As the top-selling luxury skin care brand in France for years, CLARINS expertise is a cocktail of natural botanicals, because plants and herbs contain the most effective yet gentle skin-rebalancing properties. With also the mind of pioneering innovation, formulas that are constantly reinvented, bestsellers that stand the test of time, CLARINS has made bold innovation its signature."},
{"Website": "", "Name": "City Chain Primo", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/757af3a90ee24f20f9d95e4549a58120.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/city-chain-primo-en", "Phone": "24166525", "Opening hours": "11:00-22:00", "Description": "Always on the track of pursuing the excellence is the aim of CITY CHAIN PRIMO. Perfectionists always live with quality, which also extend to their section of timepieces. The fine and marvelous timepieces from famous international watch labels at City Chain Primo are definitely the perfect choice."},
{"Website": "", "Name": "CHICKEEDUCK", "Img": "https://ntp.shkp.com/NTP/images/img_shop/fullsize/1ce5860ff4543e0af97312ce65a73fed.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/chickeeduck", "Phone": null, "Opening hours": "10:00-22:00", "Description": "Simple, elegant, easy to mix & match have always been Chickeeduck's design principles. Our product range includes casual wear, dresses, sportswear, underclothing, accessories and so on. From newborn to teenage, Chickeeduck well take care of children's need for clothes at different occasions."},
{"Website": "", "Name": "Chow Tai Fook", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/b040b02c2aad1c1a6749cfe3c6a1f3f4.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/chow-tai-fook", "Phone": "26882866", "Opening hours": "10:30-22:00", "Description": "Chow Tai Fook Jewellery Group Limited (Stock Code: 1929) was listed on the Main Board of The Stock Exchange of Hong Kong in December 2011. The iconic brand \"Chow Tai Fook\" of the Group has been widely recognised for its trustworthiness and authenticity, and renowned for product design, quality and value. The acquisition of Hearts On Fire, an internationally acclaimed U.S. premium diamond brand, in August 2014 has further underpinned the Group's stature as a diamond expert in the industry."},
{"Website": "", "Name": "Chung Yuen Electrical", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/58d1f4dc7045f87f92586a8116126bec.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/chung-yuen-electrical-0", "Phone": "26997299", "Opening hours": "11:00-22:00", "Description": "Chung Yuen Electrical was established in 1927 to distribution and retailing of electrical appliances as the main business over eighty years, provide the best products and the most enjoyable shopping experience for the people of Hong Kong."},
{"Website": "", "Name": "CASIO", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/9a069eb1d409f99979b3991268ca4f2b.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/casio", "Phone": "26011738", "Opening hours": "11:00-22:00", "Description": "Established in 1946, with tough and advanced technology, to build up different kinds of powerful and varied of watches, to satisfy all kinds of outdoor sports performance required. In order to maintain and constancy the style of brand \"Real Toughness\", CAISO will maintain and improve the advantages to combine with different elements - music, sports, arts and fashion."},
{"Website": "", "Name": "CHANEL BEAUTÉ", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/42fcc935ba55b452da28b02646f1ede0.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/chanel-beaut%C3%A9", "Phone": "26972995", "Opening hours": "10:00-22:00", "Description": "CHANEL BEAUTÉ welcomes you to discover the ultimate luxury of skincare, makeup and fragrance products served by a specialized team of beauty experts."},
{"Website": "", "Name": "CHAMPION", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/9aa168a93d94e29dfc40f2919f14d51d.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/champion", "Phone": "34285191", "Opening hours": "11:00-22:00 (Mon-Fri)\n10:30-22:30 (Sat, Sun & PH)", "Description": "Originated from New York in 1919, Champion is one of the world’s leading sports and casual wear brands. Its goal is to create functional, practical, stylish and high quality sportswear, from sports underwear to hooded sweater, Champion’s continuous innovation allows them to create various high quality clothing."},
{"Website": "", "Name": "CHARLES AND KEITH", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/6b39fb293a4af5a87a978e554aea5fb1.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/charles-and-keith-en", "Phone": "39051988", "Opening hours": "10:00-22:00", "Description": null},
{"Website": "", "Name": "CD WAREHOUSE", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/87cd94633f1950e9d097ced657a21a94.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/cd-warehouse", "Phone": "21750866", "Opening hours": "11:00-22:00", "Description": "CD Warehouse covers a variety of music and entertainment genres, from local to foreign artists, and from hi-fi to international pop music."},
{"Website": "", "Name": "CALZEDONIA", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/e4ddfcecedca5bdf41ee99ac53a45b9a.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/calzedonia", "Phone": "35801729", "Opening hours": "10:00-22:00", "Description": "The Calzedonia Group operates in 45 countries with more than 4200 stores worldwide including Hong Kong and Japan for Asia. With 30 years’ experience, Calzedonia, the Italian brand specialized in legwear and Beachwear, offers original and fashionable products for women, men and children, with ability to guarantee quality at an accessible price."},
{"Website": "", "Name": "Cath Kidston", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/c91746fb90d44da54d9f9eb8e1243edf.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/cath-kidston", "Phone": "26012068", "Opening hours": "11:30-22:00 (Mon-Thu)\n11:30-22:30 (Fri-Sun & PH)", "Description": "In 1993, aged 34 and with just £15,000, Cath Kidston opened her first namesake shop in Holland Park, London. Cath Kidston has a great range of homeware, clothing, accessories and outdoor products. The home furnishings range is inspired by textured floral prints perfect for modern country cottage to simple mono rose prints for the contemporary home."},
{"Website": "", "Name": "Catalog", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/4d37334cc802753a239530d51e76b685.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/catalog", "Phone": "26982938", "Opening hours": "11:00-22:00", "Description": "Catalog is a contemporary fashion retailer which provides unique and trendy apparel and footwear. By adding fashionable elements into sportswear, it creates a young and energetic image. Keep innovating and not simply satisfied with following the trend. Catalog always bring in some exclusive and limited branded products. Besides that, Catalog also carries some exclusive trendy brands like TTQ, ChaterBox, Rah etc, so as to provide excitement and a wide variety of products to our customers."},
{"Website": "", "Name": "ASHWORTH", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/dd4babf6fd2fba89956cbaee56f55310.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/ashworth", "Phone": "26974231", "Opening hours": "11:00-22:00", "Description": "Established in California of U.S.A. in 1987, Ashworth develops a full line of men’s and women’s golf apparel and casual merchandises with function and quality. Ashworth's function and fashion apparel best fit you, as a golf and style lover, who pursuits passion for life."},
{"Website": "", "Name": "ASICS", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/a05a43e0e880fce70307d623644125b1.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/asics-en", "Phone": "26430198", "Opening hours": "11:00-22:00", "Description": "In 1949, Mr. Kihachiro Onitsuka began his athletic footwear company (Onitsuka Co., Ltd.) by manufacturing basketball shoes out of his living room in Kobe, Japan. He chose the name ASICS for his company in 1977, based on a famous Latin phrase \"Anima Sana In Corpore Sano\", which when translated expresses the ancient ideal of \"A Sound Mind in a Sound Body.\" Taking the acronym of this phrase, ASICS was founded on the belief that the best way to create a healthy and happy lifestyle is to promote total health and fitness."},
{"Website": "", "Name": "Apple Store", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/8ca5bf6c799dc9eec79b3ef2bde4d19c.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/apple-store", "Phone": "38997800", "Opening hours": "10:00-22:00", "Description": null},
{"Website": "", "Name": "APIVITA", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/e19905e64705aa1628d38e67675ab177.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/apivita", "Phone": "26991859", "Opening hours": "10:00-22:00", "Description": "Inspired by the bee society, Greek nature and Hippocrates’ holistic approach to health, beauty and wellbeing, APIVITA has created a range of over 300 products for the hair, the face and the body with bee products, Greek plant extracts and essential oils, all clinically proven to be safe and effective."},
{"Website": "", "Name": "APM Monaco", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/4beb7d0a60841b85d357a072ef2bc1ca.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/apm-monaco", "Phone": "37554312", "Opening hours": "11:00-22:00", "Description": "Inspired by the lifestyle of Southern France and Monaco, APM Monaco is a trendy jewellery brand that combines traditional elegance and contemporary chic."},
{"Website": "", "Name": "agnès b.", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/546bb6eb88abef658ca8498bfb0c02dc.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/agn%C3%A8s-b", "Phone": "26030268", "Opening hours": "11:00-22:00", "Description": "With the French designer’s strong passion to arts and creations, Agnès b. establishes its distinctive and unique brand style that eventually proliferates into a reputable international empire. She set up her own brand in 1973 and opens the first FEMME (women’s wear) store in les Halles, Paris two years later. Agnès b. then created the HOMME (men’s wear) and ENFANT (kid’s wear) in 1981. In 1995, the first FEMME shop opened in Hong Kong. Afterwards, she created various lifestyle concept stores. Until now, there are over 200 shops in the world. agnès b. New Town Plaza houses the full collection of FEMME, HOMME, SPORT B., VOYAGE, BIJOUX, BEAUTÉ (cosmetic), FLEURISTE (florist), CAFÉ L.P.G. (café) and DÉLICES (chocolate boutique) in one single location, offering a totally brand new shopping experience with youth and energy!!"},
{"Website": "", "Name": "AIGLE", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/cf2979724a0964a2690ec754fcd3aed6.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/aigle", "Phone": "26880302", "Opening hours": "11:00-22:00", "Description": "AIGLE, master rubber craftsman since 1853, continues to hand make its boots in France. In doing so, AIGLE continues to foster a unique expertise, protecting mankind from the elements. Equipped with this legacy, AIGLE boots, shoes and clothing combine authenticity, style and practicality. High quality and attention to details are the core principles of every collation design, which guarantee a perfected and long lasting product."},
{"Website": "", "Name": "Afflelou Paris", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/bbcf7f8502768556c35b65f50e4100f5.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/afflelou-paris", "Phone": "31067253", "Opening hours": "11:00-22:00", "Description": "Afflelou Paris, business start from optician and hearing and shop in 1972 in France. With sophisticated experience in the field of franchise, the brand become the world leading optical franchise, with more than 1,400 stores across 15 countries. Afflelou Paris offers an innovation, quality and affordability products and services to customers. In 2016, Afflelou Paris starts the expansion in Asia and East Asia market. With innovative commercial offers of ‘Tchin Tchin’ in Hong Kong Store. Afflelou Paris offers the professionals services and a pairs of quality products to the customers."},
{"Website": "", "Name": "AAPE BY A BATHING APE®", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/0b996ff61e4544c6300a99898b319a62.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/aape-by-a-bathing-ape%C2%AE", "Phone": "25659307", "Opening hours": "11:00-22:00 (Mon-Thu, Sun & PH) 11:00-23:00 (Fri-Sat)", "Description": "A BATHING APE®, a brand with unremittingly creative ideas, launched a brand new vibrant young brand AAPE BY A BATHING APE® in the summer spring of 2012 (hereinafter to be referred as Aape; pronounce A-A-P-E). Aape aims to target the young menswear market, with a design of a series of concise, casual and trendy costumes for the new generation of trendsetters between age15 to 25, the comfortable cutting are suitable for the daily wear. The logo of Aape originate from the classical A BATHING APE® face MOONFACE LOGO, whose concise round face like the younger face of APE, very distinctive and impressive. The reasonable and feasible price is the important selling point of Aape, with the high standard quality of the costume, bound to be strongly welcomed by the young trendsetters."},
{"Website": "", "Name": "ADIDAS ORIGINALS", "Img": "https:\\/\\/ntp.shkp.com\\/NTP\\/images\\/img_shop\\/fullsize\\/94a7416930dbeb0f40cee9af1768722d.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/adidas-originals-en", "Phone": "26139689", "Opening hours": "11:00-22:00", "Description": "adidas Originals is the authentic, iconic sportswear label for the street, it zooms into the sidewalks across the globe and inspires consumers to go all in and represent what they are all about, as individuals and as part of a bigger whole – their crew and come together to collide their different influences, new forms of creativity and styles to create something truly new and original."},
{"Website": "", "Name": "adidas", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/f2830bc0a38104de4d2b2db8c2d0bc7b.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/adidas", "Phone": "26011893", "Opening hours": "11:00-22:00", "Description": "Here the world’s leading sportswear brand offers the widest range of the most innovative and high-quality products, including sport performance (basketball, football, running, men’s and women’s fitness and training sportswear). Shoppers will find lots of surprises; the newest and the most technological sports product for every time they come!"},
{"Website": "", "Name": "Accessorize", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/478b3d3f92c3b064ada059543bef3f61.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/accessorize", "Phone": "26021911", "Opening hours": "10:30-22:00", "Description": "Accessorize is a British brand whose first store opened in 1984 in London. Since the launch of Accessorize, the brand has presented a collection of eclectic global themes, combining traditional and trendy inspirations with intricate attention to detail and a captivating injection of colour and vibrancy. Accessorize has always been about creativity and quirkiness. It offers a giant dress up box of seasonal colour where women can indulge in a spontaneous, guilt-free shopping experience."},
{"Website": "", "Name": ":CHOCOOLATE", "Img": "http://ntp.shkp.com/NTP/images/img_shop/fullsize/df90ccd556c119a004c4fafa208ecc18.jpg", "Url": "http://www.newtownplaza.com.hk/shop/en/chocoolate", "Phone": "24300662", "Opening hours": "11:00-22:00 (Mon-Thu, Sun & PH) 11:00-23:00 (Fri-Sat)", "Description": "Launched in Fall/Winter 2006, :CHOCOOLATE is a collection of everyday wear with superior fit and great looks. A store with FUN environment to bring you a WOW shopping experience, it is created to the forward thinking individuals."}
]